5th-Semester/Business-Ethics/final.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-16 মঙ্গল 01:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Abhijit Paul" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0676f41">1. Chp 10 - Ethics Of IT Organizations</a>
<ul>
<li><a href="#orgc9f15b9">1.1. What are the Key Ethical Issues for Organizations?</a></li>
<li><a href="#org51b4ccb">1.2. Contingent Work</a>
<ul>
<li><a href="#orgd751317">1.2.1. Additional Information</a></li>
<li><a href="#orgbe38f71">1.2.2. How to obtain contingent workers?</a></li>
<li><a href="#org44fb07f">1.2.3. Advantage of Using Contingent Workers</a></li>
<li><a href="#org5021efb">1.2.4. Disadvantages of Using Contingent Workers</a></li>
<li><a href="#orgc9bc6e9">1.2.5. Deciding when to use contingent workers</a></li>
</ul>
</li>
<li><a href="#org0eafc2e">1.3. H-1B Worker</a>
<ul>
<li><a href="#org2bfd98c">1.3.1. Details</a></li>
</ul>
</li>
<li><a href="#org8657b69">1.4. Outsourcing</a>
<ul>
<li><a href="#org976e0e9">1.4.1. Details</a></li>
</ul>
</li>
<li><a href="#orgbaa2083">1.5. Strategies for successful offshore outsouring</a></li>
<li><a href="#org8eea47d">1.6. Whitle-blowing</a>
<ul>
<li><a href="#org9624558">1.6.1. Protection of Whistle-blowers</a></li>
<li><a href="#orgcf523a3">1.6.2. Whistle-blowing in private sectors</a></li>
<li><a href="#orge80f2fb">1.6.3. Dealing with a whistleblowing situation</a></li>
</ul>
</li>
<li><a href="#org44585fa">1.7. Green Computing</a></li>
<li><a href="#org82e07f0">1.8. ICT INDUSTRY CODE OF CONDUCT</a>
<ul>
<li><a href="#org2608b3c">1.8.1. Labor</a></li>
<li><a href="#org1fab599">1.8.2. Health and Safety</a></li>
<li><a href="#orgd342209">1.8.3. Environmental</a></li>
<li><a href="#orgd2e8b6c">1.8.4. Management System</a></li>
<li><a href="#orgdc4be2c">1.8.5. Ethics</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org074e1de">2. Chp 6 - Intellectual Property</a>
<ul>
<li><a href="#org942870d">2.1. Copyright</a></li>
<li><a href="#orgd5a686a">2.2. Software Copyright Protection Laws</a>
<ul>
<li><a href="#org427f227">2.2.1. The Prioritizing Resources and Organization for Intellectual Property (PRO-IP) Act of 2008</a></li>
<li><a href="#orgf5c8382">2.2.2. General Agreement on Tariffs and Trade (GATT)</a></li>
<li><a href="#orge977b35">2.2.3. The WTO and the WTO TRIPS Agreement (1994)</a></li>
<li><a href="#org08365be">2.2.4. The World Intellectual Property Organization (WIPO) Copyright Treaty (1996</a></li>
<li><a href="#org6c69e16">2.2.5. The Digital Millennium Copyright Act (1998)</a></li>
</ul>
</li>
<li><a href="#orga23257e">2.3. Patent</a></li>
<li><a href="#org1a20747">2.4. Cross-Licensing Agreements</a></li>
<li><a href="#org9ba3c27">2.5. Trade Secret</a>
<ul>
<li><a href="#orgec71b47">2.5.1. Employee &amp; Trade Secrets</a></li>
<li><a href="#org7466608">2.5.2. Steps to protect trade secret</a></li>
</ul>
</li>
<li><a href="#orge974c20">2.6. Trade Secret Laws</a>
<ul>
<li><a href="#org967416f">2.6.1. Uniform Trade Secrets Act (UTSA)</a></li>
<li><a href="#org5e2a6cb">2.6.2. The Economic Espionage Act (EEA) (1996)</a></li>
</ul>
</li>
<li><a href="#org2b15f62">2.7. KEY INTELLECTUAL PROPERTY ISSUES</a>
<ul>
<li><a href="#org6bb14a5">2.7.1. Plagiarism</a></li>
<li><a href="#org6203251">2.7.2. Reverse Engineering</a></li>
<li><a href="#org4cc84ba">2.7.3. Open Source Code</a></li>
<li><a href="#org7e79b28">2.7.4. Competitive Intelligence</a></li>
<li><a href="#org987885d">2.7.5. Trademark Infringement</a></li>
<li><a href="#org04726a1">2.7.6. Cybersquatting</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org357bb9a">3. Chp 3 - Computer &amp; Internet Crime</a>
<ul>
<li><a href="#orgb344442">3.1. Why Computer Incidents Are So Prevalent?</a></li>
<li><a href="#org6731d5a">3.2. Prevention</a></li>
</ul>
</li>
<li><a href="#org9049393">4. Chp 2 - forgot name</a>
<ul>
<li><a href="#org88d5040">4.1. What is professionalism? Are IT Workers Professional?</a></li>
<li><a href="#orgece3d47">4.2. Relationship between IT workers and client</a>
<ul>
<li><a href="#org9700b5c">4.2.1. Potential Issues</a></li>
</ul>
</li>
<li><a href="#orgcc70a43">4.3. Relationships Between IT Workers and Suppliers</a></li>
<li><a href="#org0962374">4.4. Relationships Between IT Workers and Other Professionals</a></li>
<li><a href="#orgb0300c1">4.5. Relationships between IT Workers and IT Users</a></li>
<li><a href="#org0fe3c15">4.6. Relationships Between IT Workers and Society</a></li>
<li><a href="#org6dbb765">4.7. Certification</a>
<ul>
<li><a href="#orgf5007a3">4.7.1. Vendor Certifications</a></li>
<li><a href="#org90ba441">4.7.2. Industry Association Certifications</a></li>
</ul>
</li>
<li><a href="#org27c857e">4.8. Compliance</a></li>
<li><a href="#org3a7196b">4.9. What is professionalism? Are IT Workers professional?</a></li>
<li><a href="#org8c604d5">4.10. Issues in Employer Relationships/ Relationship between IT Worker &amp; Professional</a>
<ul>
<li><a href="#org19a2ba8">4.10.1. Trade Secret</a></li>
<li><a href="#org1b744a9">4.10.2. Software Business Alliance</a></li>
<li><a href="#orgb03b937">4.10.3. Whistleblowers</a></li>
</ul>
</li>
<li><a href="#org8844df6">4.11. Professional Relationships that must be maintained</a></li>
<li><a href="#orgf177b45">4.12. What is a professional code of ethics? Discuss about its 4 fundamental principles.</a></li>
<li><a href="#org8c1f52b">4.13. What are IT Professional Organizations? List some of the organizations and their roles.</a>
<ul>
<li><a href="#org5c8a12d">4.13.1. Association for Computing Machinery (ACM):</a></li>
<li><a href="#org39b7614">4.13.2. Institute of Electrical and Electronics Engineers Computer Society (IEEE-CS):</a></li>
<li><a href="#org55a01ae">4.13.3. Association of Information Technology Professionals (AITP):</a></li>
<li><a href="#org8cc5367">4.13.4. SysAdmin, Audit, Network, Security (SANS) Institute:</a></li>
</ul>
</li>
<li><a href="#org2c1e19b">4.14. Common Ethical Issues of IT Users(Page 61)</a></li>
<li><a href="#orgd68c83d">4.15. Supporting the Ethical Practices of IT Users</a></li>
<li><a href="#orga9140cc">4.16. IT Professional Malpractice</a></li>
<li><a href="#org38fcb76">4.17. SMall Definitions</a></li>
</ul>
</li>
<li><a href="#org390e9f2">5. Chp 7 - Software Development</a>
<ul>
<li><a href="#orga8b97f4">5.1. Definition of Quality</a></li>
<li><a href="#org06a07b9">5.2. Types of Quality</a></li>
<li><a href="#org6bdb6c9">5.3. Quality Assurance</a></li>
<li><a href="#orgc01b530">5.4. Quality Control</a></li>
<li><a href="#org4b70481">5.5. Cost Of Quality</a>
<ul>
<li><a href="#orgb3df5a5">5.5.1. Types of Cost of Quality</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1254d3d">6. Questions</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0676f41" class="outline-2">
<h2 id="org0676f41"><span class="section-number-2">1.</span> Chp 10 - Ethics Of IT Organizations</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc9f15b9" class="outline-3">
<h3 id="orgc9f15b9"><span class="section-number-3">1.1.</span> What are the Key Ethical Issues for Organizations?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This chapter touches on the following ethical topics that are pertinent to organizations in the IT industry, as well as to organizations that make use of IT:
</p>

<ol class="org-ol">
<li>The use of nontraditional workers, including temporary workers, contractors, consulting firms, H-1B visa workers, and outsourced offshore workers, gives an organization more flexibility in meeting its staffing needs, often at a lower cost Ethics of IT Organizations than if the organization used traditional workers. The use of nontraditional workers also raises ethical issues for organizations. When should such nontraditional workers be employed, and how does such employment affect an organization’s ability to grow and develop its own employees? How does the use of nontraditional workers impact the wages of the organization’s own employees?</li>
<li>Whistle-blowing, as discussed in Chapter 2, is an effort to attract public attention to a negligent, illegal, unethical, abusive, or dangerous act by a company or some other organization. It is an important ethical issue for individuals and organizations. How can you safely and effectively report mis- conduct, and how should managers handle a whistle-blowing incident?</li>
<li>Green computing is a term applied to a variety of efforts directed toward the efficient design, manufacture, operation, and disposal of IT-related products, including personal computers, laptops, servers, printers, and printer supplies. Computer manufacturers and end users are faced with many questions about when and how to transition to green computing, and at what cost.</li>
<li>The electronics and information and communications technology (ICT) industry recognizes the need for a code to address ethical issues in the areas of worker safety and fairness, environmental responsibility, and business efficiency. What has been done so far, and what still needs to be done.</li>
</ol>
</div>
</div>

<div id="outline-container-org51b4ccb" class="outline-3">
<h3 id="org51b4ccb"><span class="section-number-3">1.2.</span> Contingent Work</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Contingent work is a job situation in which an individual does not have an <code>explicit or implicit contract</code> for long-term employment.
</p>
</div>
