5th-Semester/Business-Ethics/final.org
*** Additional Information
- The contingent workforce includes independent contractors, temporary workers hired through employment agencies, on-call or day laborers, and on-site workers whose services are provided through contract firms.
- A firm is likely to use contingent IT workers if it experiences pronounced fluctuations in its technical staffing needs.
- Typically, these workers join a team of full-time employees and other contingent workers for the life of the project and then move on to their next assignment.
- Whether they work, when they work, and how much they work depends on the company’s need for them.
*** How to obtain contingent workers?
Organizations can obtain contingent workers in one of the following two ways.
  
**** Temporary Staffing Farms
   Temporary staffing firms recruit, train, and test job seekers in a wide range of job categories and skill levels, and then assign them to clients as needed.


- Temporary employees are often used to fill in during staff vacations and illnesses,handle seasonal workloads, and help staff special projects.

- They are not considered official employees of the company, so they are not eligible for company benefits such as vacation, sick pay, and medical insurance

- Because temporary workers do not receive additional compensation through company benefits, they are often paid a higher hourly wage than full-time employees doing equivalent work.

- Temporary working arrangements sometimes appeal to people who want maximum flexibility in their work schedule as well as a variety of work experiences. Other workers take temporary work assignments only because they are unable to find more permanent work.

**** Employee Leasing
In Employee leasing, a business (called the ~subscribing firm~) transfers all or part of its workforce to another firm (called the ~leasing firm~), which handles all human-resource-related activities and costs, such as payroll, training, and the administration of employee benefits.

- Employee leasing firms operate with minimal administrative, sales, and marketing staff to keep down overall costs, and they pass the savings on to their clients.
- Employee leasing firms are subject to special regulations regarding workers’ compensation and unemployment insurance. Because the workers are technically employees of the leasing firm, they may be eligible for some company benefits through the firm.

- The subscribing firm leases these workers, but they remain employees of the leasing firm.

***** Coemployment
Employee leasing is a type of ~coemployment~ relationship, in which ~two employers~ have actual or potential legal rights and duties with respect to the same employee or group of employees.

**** Consulting Firms
Organizations can also obtain temporary IT employees by hiring a consulting firm. Consulting organizations maintain a staff of employees with a wide range of skills and experience, up to and including world-renowned industry experts; thus, these firms can often provide the exact skills and expertise that an organization requires for a ~particular project~.

Consulting firms work with their clients on engagements for which there are typically well-defined expected results or deliverables that must be produced (e.g., creation of an IT strategic plan, implementation of an enterprise resource planning [ERP] system, or selection of a hardware vendor).

The contract with a consulting firm typically specifies the length of the engagement and the rate of pay for each of the consultants, who are directed on the engagement by a senior manager or director from the consulting firm. 

*** Advantage of Using Contingent Workers
1. When a firm employs a contingent worker, it does not usually have to provide benefits such as insurance, paid time off, and contributions to a retirement plan.

2. A company can easily adjust the number of contingent workers it uses to meet its business needs, and can release contingent workers when they are no longer needed. An organization cannot usually do the same with full-time employees without creating a great deal of ill will and negatively impacting employee morale.

3. Moreover, because many contingent workers are already specialists in a particular task, a firm does not customarily incur training costs for contingent workers.

 Therefore, the use of contingent workers can enable a firm to meet its staffing needs more efficiently, lower its labor costs, and respond more quickly to changing market conditions.

