5th-Semester/Business-Ethics/final.html
<div id="outline-container-orgd751317" class="outline-4">
<h4 id="orgd751317"><span class="section-number-4">1.2.1.</span> Additional Information</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>The contingent workforce includes independent contractors, temporary workers hired through employment agencies, on-call or day laborers, and on-site workers whose services are provided through contract firms.</li>
<li>A firm is likely to use contingent IT workers if it experiences pronounced fluctuations in its technical staffing needs.</li>
<li>Typically, these workers join a team of full-time employees and other contingent workers for the life of the project and then move on to their next assignment.</li>
<li>Whether they work, when they work, and how much they work depends on the company’s need for them.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbe38f71" class="outline-4">
<h4 id="orgbe38f71"><span class="section-number-4">1.2.2.</span> How to obtain contingent workers?</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Organizations can obtain contingent workers in one of the following two ways.
</p>
</div>

<ol class="org-ol">
<li><a id="orge84d664"></a>Temporary Staffing Farms<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
Temporary staffing firms recruit, train, and test job seekers in a wide range of job categories and skill levels, and then assign them to clients as needed.
</p>


<ul class="org-ul">
<li>Temporary employees are often used to fill in during staff vacations and illnesses,handle seasonal workloads, and help staff special projects.</li>

<li>They are not considered official employees of the company, so they are not eligible for company benefits such as vacation, sick pay, and medical insurance</li>

<li>Because temporary workers do not receive additional compensation through company benefits, they are often paid a higher hourly wage than full-time employees doing equivalent work.</li>

<li>Temporary working arrangements sometimes appeal to people who want maximum flexibility in their work schedule as well as a variety of work experiences. Other workers take temporary work assignments only because they are unable to find more permanent work.</li>
</ul>
</div>
</li>

<li><a id="orgc2f5a92"></a>Employee Leasing<br />
<div class="outline-text-5" id="text-1-2-2-2">
<p>
In Employee leasing, a business (called the <code>subscribing firm</code>) transfers all or part of its workforce to another firm (called the <code>leasing firm</code>), which handles all human-resource-related activities and costs, such as payroll, training, and the administration of employee benefits.
</p>

<ul class="org-ul">
<li>Employee leasing firms operate with minimal administrative, sales, and marketing staff to keep down overall costs, and they pass the savings on to their clients.</li>
<li>Employee leasing firms are subject to special regulations regarding workers’ compensation and unemployment insurance. Because the workers are technically employees of the leasing firm, they may be eligible for some company benefits through the firm.</li>

<li>The subscribing firm leases these workers, but they remain employees of the leasing firm.</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org121f916"></a>Coemployment<br />
<div class="outline-text-6" id="text-1-2-2-2-1">
<p>
Employee leasing is a type of <code>coemployment</code> relationship, in which <code>two employers</code> have actual or potential legal rights and duties with respect to the same employee or group of employees.
</p>
</div>
</li>
</ol>
</li>

<li><a id="org0ffdc89"></a>Consulting Firms<br />
<div class="outline-text-5" id="text-1-2-2-3">
<p>
Organizations can also obtain temporary IT employees by hiring a consulting firm. Consulting organizations maintain a staff of employees with a wide range of skills and experience, up to and including world-renowned industry experts; thus, these firms can often provide the exact skills and expertise that an organization requires for a <code>particular project</code>.
</p>

<p>
Consulting firms work with their clients on engagements for which there are typically well-defined expected results or deliverables that must be produced (e.g., creation of an IT strategic plan, implementation of an enterprise resource planning [ERP] system, or selection of a hardware vendor).
</p>

<p>
The contract with a consulting firm typically specifies the length of the engagement and the rate of pay for each of the consultants, who are directed on the engagement by a senior manager or director from the consulting firm. 
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org44fb07f" class="outline-4">
<h4 id="org44fb07f"><span class="section-number-4">1.2.3.</span> Advantage of Using Contingent Workers</h4>
<div class="outline-text-4" id="text-1-2-3">
<ol class="org-ol">
<li>When a firm employs a contingent worker, it does not usually have to provide benefits such as insurance, paid time off, and contributions to a retirement plan.</li>

<li>A company can easily adjust the number of contingent workers it uses to meet its business needs, and can release contingent workers when they are no longer needed. An organization cannot usually do the same with full-time employees without creating a great deal of ill will and negatively impacting employee morale.</li>

<li><p>
Moreover, because many contingent workers are already specialists in a particular task, a firm does not customarily incur training costs for contingent workers.
</p>

<p>
Therefore, the use of contingent workers can enable a firm to meet its staffing needs more efficiently, lower its labor costs, and respond more quickly to changing market conditions.
</p></li>
</ol>
</div>
</div>
