5th-Semester/Business-Ethics/final.tex
\subsubsection{Additional Information}
\label{sec:orgd1f9c54}
\begin{itemize}
\item The contingent workforce includes independent contractors, temporary workers hired through employment agencies, on-call or day laborers, and on-site workers whose services are provided through contract firms.
\item A firm is likely to use contingent IT workers if it experiences pronounced fluctuations in its technical staffing needs.
\item Typically, these workers join a team of full-time employees and other contingent workers for the life of the project and then move on to their next assignment.
\item Whether they work, when they work, and how much they work depends on the company’s need for them.
\end{itemize}
\subsubsection{How to obtain contingent workers?}
\label{sec:orgb693e9c}
Organizations can obtain contingent workers in one of the following two ways.

\begin{enumerate}
\item Temporary Staffing Farms
\label{sec:org41c46cd}
Temporary staffing firms recruit, train, and test job seekers in a wide range of job categories and skill levels, and then assign them to clients as needed.


\begin{itemize}
\item Temporary employees are often used to fill in during staff vacations and illnesses,handle seasonal workloads, and help staff special projects.

\item They are not considered official employees of the company, so they are not eligible for company benefits such as vacation, sick pay, and medical insurance

\item Because temporary workers do not receive additional compensation through company benefits, they are often paid a higher hourly wage than full-time employees doing equivalent work.

\item Temporary working arrangements sometimes appeal to people who want maximum flexibility in their work schedule as well as a variety of work experiences. Other workers take temporary work assignments only because they are unable to find more permanent work.
\end{itemize}

\item Employee Leasing
\label{sec:org16c8510}
In Employee leasing, a business (called the \texttt{subscribing firm}) transfers all or part of its workforce to another firm (called the \texttt{leasing firm}), which handles all human-resource-related activities and costs, such as payroll, training, and the administration of employee benefits.

\begin{itemize}
\item Employee leasing firms operate with minimal administrative, sales, and marketing staff to keep down overall costs, and they pass the savings on to their clients.
\item Employee leasing firms are subject to special regulations regarding workers’ compensation and unemployment insurance. Because the workers are technically employees of the leasing firm, they may be eligible for some company benefits through the firm.

\item The subscribing firm leases these workers, but they remain employees of the leasing firm.
\end{itemize}

\begin{enumerate}
\item Coemployment
\label{sec:org8154d35}
Employee leasing is a type of \texttt{coemployment} relationship, in which \texttt{two employers} have actual or potential legal rights and duties with respect to the same employee or group of employees.
\end{enumerate}

\item Consulting Firms
\label{sec:orgf0d09d1}
Organizations can also obtain temporary IT employees by hiring a consulting firm. Consulting organizations maintain a staff of employees with a wide range of skills and experience, up to and including world-renowned industry experts; thus, these firms can often provide the exact skills and expertise that an organization requires for a \texttt{particular project}.

Consulting firms work with their clients on engagements for which there are typically well-defined expected results or deliverables that must be produced (e.g., creation of an IT strategic plan, implementation of an enterprise resource planning [ERP] system, or selection of a hardware vendor).

The contract with a consulting firm typically specifies the length of the engagement and the rate of pay for each of the consultants, who are directed on the engagement by a senior manager or director from the consulting firm.
\end{enumerate}

\subsubsection{Advantage of Using Contingent Workers}
\label{sec:org5ad4906}
\begin{enumerate}
\item When a firm employs a contingent worker, it does not usually have to provide benefits such as insurance, paid time off, and contributions to a retirement plan.

\item A company can easily adjust the number of contingent workers it uses to meet its business needs, and can release contingent workers when they are no longer needed. An organization cannot usually do the same with full-time employees without creating a great deal of ill will and negatively impacting employee morale.

\item Moreover, because many contingent workers are already specialists in a particular task, a firm does not customarily incur training costs for contingent workers.

Therefore, the use of contingent workers can enable a firm to meet its staffing needs more efficiently, lower its labor costs, and respond more quickly to changing market conditions.
\end{enumerate}
