5th-Semester/Business-Ethics/final.org
*** Disadvantages of Using Contingent Workers
1. One downside to using contingent workers is that they may not feel a strong connection to the company for which they are working. This can result in a low commitment to the company and its projects, along with a high turnover rate.

2. Although contingent workers may already have the necessary technical training for a temporary job, many contingent workers gain additional skills and knowledge while working for a particular company; those assets are lost to the company when a contingent worker departs at a project’s completion.

*** Deciding when to use contingent workers
The ~trade-off~ between completing a single project quickly and cheaply versus developing people within its own organization.

1. If the project requires unique skills that are probably not necessary for future projects, there may be little reason to invest the additional time and costs required to develop those skills in full-time employees. Or,
2. if a particular project requires only temporary help that will not be needed for future projects, the use of contingent workers is a good approach.


However, organizations should carefully consider whether or not to use contingent workers when those workers are likely to learn ~corporate processes and strategies~ that are key to the company’s success. It is next to impossible to prevent contingent workers from passing on such information to subsequent employers. This can be damaging if the worker’s next employer is a major competitor.

Though using contingent workers is often the most flexible and cost-effective way to get a job done, their use can raise ~ethical and legal issues about the relationships~ among the staffing firm, its employees, and its customers—including the potential liability of a staffing firm’s customers for withholding payroll taxes, payment of employee retirement benefits and health insurance premiums, and administration of workers’ compensation to the staffing firm’s employees.

Additionally, Depending on how closely workers are ~supervised and how the job is structured~, contingent workers may be viewed as permanent employees by the Internal Revenue Service, the Department of Labor, or a state’s workers’ compensation and unemployment agencies.

** H-1B Worker
An H-1B visa is a temporary work visa granted by the  (USCIS) for people who work in specialty occupations—jobs that require at least a four-year bachelor’s degree in a specific field, or equivalent experience.

USCIS = U.S. Citizenship and Immigration Services

A person can work for a U.S. employer as an H-1B employee for a maximum continuous period of six years.

Considerations:
- English Skills
- Innovation & Entrepreneurship
- Heavy reliance on the use of H-1B workers can lessen the incentive for U.S. companies to educate and develop their own workforces.

Potenial Expoitation:
- Low Wage
- Fraud

*** Details
When considering the use of H-1B visa workers, companies should take into account that even highly skilled and experienced H-1B workers may require help with their ~English skills~.


The researchers also concluded that “there is substantial evidence that H-1B admissions appear to directly improve levels of innovation and entrepreneurship, which in the long term should create new jobs and raise demand for technology workers in other areas."

**** Using H-1B Workers Instead of U.S. Workers
In order to compete in the global economy, U.S. firms must be able to attract the best and brightest workers from all over the world. Most H-1B workers are brought to the United States to fill a legitimate gap that cannot be filled from the existing pool of workers.

However, there are some managers who reason that as long as skilled foreign workers can be found to fill critical positions, ~why invest thousands of dollars and months of training to develop their current U.S. workers?~ Heavy reliance on the use of H-1B workers can lessen the incentive for U.S. companies to educate and develop their own workforces.

