5th-Semester/Business-Ethics/final.html

<div id="outline-container-org5021efb" class="outline-4">
<h4 id="org5021efb"><span class="section-number-4">1.2.4.</span> Disadvantages of Using Contingent Workers</h4>
<div class="outline-text-4" id="text-1-2-4">
<ol class="org-ol">
<li>One downside to using contingent workers is that they may not feel a strong connection to the company for which they are working. This can result in a low commitment to the company and its projects, along with a high turnover rate.</li>

<li>Although contingent workers may already have the necessary technical training for a temporary job, many contingent workers gain additional skills and knowledge while working for a particular company; those assets are lost to the company when a contingent worker departs at a project’s completion.</li>
</ol>
</div>
</div>

<div id="outline-container-orgc9bc6e9" class="outline-4">
<h4 id="orgc9bc6e9"><span class="section-number-4">1.2.5.</span> Deciding when to use contingent workers</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
The <code>trade-off</code> between completing a single project quickly and cheaply versus developing people within its own organization.
</p>

<ol class="org-ol">
<li>If the project requires unique skills that are probably not necessary for future projects, there may be little reason to invest the additional time and costs required to develop those skills in full-time employees. Or,</li>
<li>if a particular project requires only temporary help that will not be needed for future projects, the use of contingent workers is a good approach.</li>
</ol>


<p>
However, organizations should carefully consider whether or not to use contingent workers when those workers are likely to learn <code>corporate processes and strategies</code> that are key to the company’s success. It is next to impossible to prevent contingent workers from passing on such information to subsequent employers. This can be damaging if the worker’s next employer is a major competitor.
</p>

<p>
Though using contingent workers is often the most flexible and cost-effective way to get a job done, their use can raise <code>ethical and legal issues about the relationships</code> among the staffing firm, its employees, and its customers—including the potential liability of a staffing firm’s customers for withholding payroll taxes, payment of employee retirement benefits and health insurance premiums, and administration of workers’ compensation to the staffing firm’s employees.
</p>

<p>
Additionally, Depending on how closely workers are <code>supervised and how the job is structured</code>, contingent workers may be viewed as permanent employees by the Internal Revenue Service, the Department of Labor, or a state’s workers’ compensation and unemployment agencies.
</p>
</div>
</div>
</div>

<div id="outline-container-org0eafc2e" class="outline-3">
<h3 id="org0eafc2e"><span class="section-number-3">1.3.</span> H-1B Worker</h3>
<div class="outline-text-3" id="text-1-3">
<p>
An H-1B visa is a temporary work visa granted by the  (USCIS) for people who work in specialty occupations—jobs that require at least a four-year bachelor’s degree in a specific field, or equivalent experience.
</p>

<p>
USCIS = U.S. Citizenship and Immigration Services
</p>

<p>
A person can work for a U.S. employer as an H-1B employee for a maximum continuous period of six years.
</p>

<p>
Considerations:
</p>
<ul class="org-ul">
<li>English Skills</li>
<li>Innovation &amp; Entrepreneurship</li>
<li>Heavy reliance on the use of H-1B workers can lessen the incentive for U.S. companies to educate and develop their own workforces.</li>
</ul>

<p>
Potenial Expoitation:
</p>
<ul class="org-ul">
<li>Low Wage</li>
<li>Fraud</li>
</ul>
</div>

<div id="outline-container-org2bfd98c" class="outline-4">
<h4 id="org2bfd98c"><span class="section-number-4">1.3.1.</span> Details</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
When considering the use of H-1B visa workers, companies should take into account that even highly skilled and experienced H-1B workers may require help with their <code>English skills</code>.
</p>


<p>
The researchers also concluded that “there is substantial evidence that H-1B admissions appear to directly improve levels of innovation and entrepreneurship, which in the long term should create new jobs and raise demand for technology workers in other areas."
</p>
</div>

<ol class="org-ol">
<li><a id="org88188dd"></a>Using H-1B Workers Instead of U.S. Workers<br />
<div class="outline-text-5" id="text-1-3-1-1">
<p>
In order to compete in the global economy, U.S. firms must be able to attract the best and brightest workers from all over the world. Most H-1B workers are brought to the United States to fill a legitimate gap that cannot be filled from the existing pool of workers.
</p>

<p>
However, there are some managers who reason that as long as skilled foreign workers can be found to fill critical positions, <code>why invest thousands of dollars and months of training to develop their current U.S. workers?</code> Heavy reliance on the use of H-1B workers can lessen the incentive for U.S. companies to educate and develop their own workforces.
</p>
</div>
</li>
</ol>
</div>
</div>
