5th-Semester/Business-Ethics/final.tex

\subsubsection{Disadvantages of Using Contingent Workers}
\label{sec:orgf5f1bcb}
\begin{enumerate}
\item One downside to using contingent workers is that they may not feel a strong connection to the company for which they are working. This can result in a low commitment to the company and its projects, along with a high turnover rate.

\item Although contingent workers may already have the necessary technical training for a temporary job, many contingent workers gain additional skills and knowledge while working for a particular company; those assets are lost to the company when a contingent worker departs at a project’s completion.
\end{enumerate}

\subsubsection{Deciding when to use contingent workers}
\label{sec:org65f7b7a}
The \texttt{trade-off} between completing a single project quickly and cheaply versus developing people within its own organization.

\begin{enumerate}
\item If the project requires unique skills that are probably not necessary for future projects, there may be little reason to invest the additional time and costs required to develop those skills in full-time employees. Or,
\item if a particular project requires only temporary help that will not be needed for future projects, the use of contingent workers is a good approach.
\end{enumerate}


However, organizations should carefully consider whether or not to use contingent workers when those workers are likely to learn \texttt{corporate processes and strategies} that are key to the company’s success. It is next to impossible to prevent contingent workers from passing on such information to subsequent employers. This can be damaging if the worker’s next employer is a major competitor.

Though using contingent workers is often the most flexible and cost-effective way to get a job done, their use can raise \texttt{ethical and legal issues about the relationships} among the staffing firm, its employees, and its customers—including the potential liability of a staffing firm’s customers for withholding payroll taxes, payment of employee retirement benefits and health insurance premiums, and administration of workers’ compensation to the staffing firm’s employees.

Additionally, Depending on how closely workers are \texttt{supervised and how the job is structured}, contingent workers may be viewed as permanent employees by the Internal Revenue Service, the Department of Labor, or a state’s workers’ compensation and unemployment agencies.

\subsection{H-1B Worker}
\label{sec:org78316b4}
An H-1B visa is a temporary work visa granted by the  (USCIS) for people who work in specialty occupations—jobs that require at least a four-year bachelor’s degree in a specific field, or equivalent experience.

USCIS = U.S. Citizenship and Immigration Services

A person can work for a U.S. employer as an H-1B employee for a maximum continuous period of six years.

Considerations:
\begin{itemize}
\item English Skills
\item Innovation \& Entrepreneurship
\item Heavy reliance on the use of H-1B workers can lessen the incentive for U.S. companies to educate and develop their own workforces.
\end{itemize}

Potenial Expoitation:
\begin{itemize}
\item Low Wage
\item Fraud
\end{itemize}

\subsubsection{Details}
\label{sec:org51a13a2}
When considering the use of H-1B visa workers, companies should take into account that even highly skilled and experienced H-1B workers may require help with their \texttt{English skills}.


The researchers also concluded that “there is substantial evidence that H-1B admissions appear to directly improve levels of innovation and entrepreneurship, which in the long term should create new jobs and raise demand for technology workers in other areas."

\begin{enumerate}
\item Using H-1B Workers Instead of U.S. Workers
\label{sec:org32a1119}
In order to compete in the global economy, U.S. firms must be able to attract the best and brightest workers from all over the world. Most H-1B workers are brought to the United States to fill a legitimate gap that cannot be filled from the existing pool of workers.

However, there are some managers who reason that as long as skilled foreign workers can be found to fill critical positions, \texttt{why invest thousands of dollars and months of training to develop their current U.S. workers?} Heavy reliance on the use of H-1B workers can lessen the incentive for U.S. companies to educate and develop their own workforces.
\end{enumerate}
