5th-Semester/Business-Ethics/final.html

<div id="outline-container-org8657b69" class="outline-3">
<h3 id="org8657b69"><span class="section-number-3">1.4.</span> Outsourcing</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Outsourcing is a long-term business arrangement in which a company contracts for services with an <code>outside organization</code> that has expertise in providing a specific function.
</p>

<ul class="org-ul">
<li>Coemployment legal issues are minimal.</li>
<li>Speeding up project schedeule.</li>
</ul>

<p>
Offshore outsourcing is a form of outsourcing in which the services are provided by an organization whose employees are in a <code>foreign country.</code>
</p>
<ul class="org-ul">
<li>Low-cost foreign countries</li>
</ul>

<p>
Organizations must consider many factors when deciding where to locate outsourcing activities.
</p>
<ul class="org-ul">
<li>Political Unrest in foreign country</li>
<li>Global Services Location Index</li>
</ul>

<p>
Pros And Cons of Offshore Outsourcing:
</p>
<ol class="org-ol">
<li>24 hour workday</li>
<li>Lower cost</li>
<li>It takes years of ongoing effort and a large upfront investment to develop a good relationship with an offshore outsourcing firm.</li>
<li>Finding a reputable vendor can be difficult for medium or small firms that lack experience in identifying and vetting contractors.</li>
<li>The trade-offs between using offshore outsourcing firms and devoting money and time to retain and develop their own staff</li>
<li>A company loses the knowledge and experience gained by outsourced workers when those workers are reassigned after a project’s completion.</li>
<li>Cultural and language differences</li>
<li>The compromising of customer data</li>
</ol>
</div>

<div id="outline-container-org976e0e9" class="outline-4">
<h4 id="org976e0e9"><span class="section-number-4">1.4.1.</span> Details</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Coemployment legal problems with outsourcing are minimal, because the company that contracts for the services does not generally supervise or control the contractor’s employees. The primary rationale for outsourcing is to lower costs, but companies also use it to obtain strategic flexibility and to keep their staff focused on the company’s core competencies.
</p>
</div>
<ol class="org-ol">
<li><a id="org9274dce"></a>Offshore Outsourcing<br />
<div class="outline-text-5" id="text-1-4-1-1">
<p>
Offshore outsourcing is a form of outsourcing in which the services are provided by an organization whose employees are in a <code>foreign country.</code>
</p>

<ol class="org-ol">
<li>Any work done at a relatively high cost in the United States may become a candidate for offshore outsourcing—not just IT work. However, IT professionals in particular can do much of their work anywhere.</li>
</ol>

<p>
As more businesses move their key processes offshore, U.S. IT service providers are forced to lower prices. Many U.S. software firms set up development centers in low-cost foreign countries where they have access to a large pool of well-trained candidates
</p>

<p>
Organizations must consider many factors when deciding where to locate outsourcing
activities.
</p>
<ul class="org-ul">
<li>Political Unrest in foreign country</li>
<li>Global Services Location Index</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org4eba21a"></a>Pros of Offshore Outsouring<br />
<div class="outline-text-6" id="text-1-4-1-1-1">
<ul class="org-ul">
<li>Wages that an American worker might consider low represent an excellent salary in many</li>
</ul>
<p>
other parts of the world, and some companies feel they would be foolish not to exploit such
an opportunity. Why pay a U.S. IT worker a six-figure salary, they reason, when they can
use offshore outsourcing to hire three India-based workers for the same cost? However, this
attitude might represent a short-term point of view—offshore demand is driving up salaries
in India by roughly 15 percent per year. Because of this, Indian offshore suppliers have
begun to charge more for their services. The cost advantage for offshore outsourcing to India
used to be 6:1 or more—you could hire six Indian IT workers for the cost of one U.S. IT
worker. The cost advantage is shrinking, and once it reaches about 1.5:1, the cost savings
will no longer be much of an incentive for U.S. offshore outsourcing to India.
</p>

<ul class="org-ul">
<li>“24-hour workday”</li>
<li></li>
</ul>
</div>
</li>
<li><a id="org1087d3a"></a>Cons of Offshore Outsourcing<br />
<div class="outline-text-6" id="text-1-4-1-1-2">
<p>
In addition, organizations often find it takes years of ongoing effort and a large up-front investment to develop a good working relationship with an offshore outsourcing firm. Finding a reputable vendor can be especially difficult for a small or midsized firm that lacks experience in identifying and vetting contractors
</p>


<p>
The trade-offs between using offshore outsourcing firms and devoting money and time to retain and develop their own staff
</p>

<p>
Another downside to offshore outsourcing is that a company loses the knowledge and experience gained by outsourced workers when those workers are reassigned after a project’s completion.
</p>

<p>
Cultural and language differences
</p>

<p>
The compromising of customer data
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
