5th-Semester/Business-Ethics/final.tex

\subsection{Outsourcing}
\label{sec:orgec432b7}
Outsourcing is a long-term business arrangement in which a company contracts for services with an \texttt{outside organization} that has expertise in providing a specific function.

\begin{itemize}
\item Coemployment legal issues are minimal.
\item Speeding up project schedeule.
\end{itemize}

Offshore outsourcing is a form of outsourcing in which the services are provided by an organization whose employees are in a \texttt{foreign country.}
\begin{itemize}
\item Low-cost foreign countries
\end{itemize}

Organizations must consider many factors when deciding where to locate outsourcing activities.
\begin{itemize}
\item Political Unrest in foreign country
\item Global Services Location Index
\end{itemize}

Pros And Cons of Offshore Outsourcing:
\begin{enumerate}
\item 24 hour workday
\item Lower cost
\item It takes years of ongoing effort and a large upfront investment to develop a good relationship with an offshore outsourcing firm.
\item Finding a reputable vendor can be difficult for medium or small firms that lack experience in identifying and vetting contractors.
\item The trade-offs between using offshore outsourcing firms and devoting money and time to retain and develop their own staff
\item A company loses the knowledge and experience gained by outsourced workers when those workers are reassigned after a project’s completion.
\item Cultural and language differences
\item The compromising of customer data
\end{enumerate}

\subsubsection{Details}
\label{sec:orgbedf9de}
Coemployment legal problems with outsourcing are minimal, because the company that contracts for the services does not generally supervise or control the contractor’s employees. The primary rationale for outsourcing is to lower costs, but companies also use it to obtain strategic flexibility and to keep their staff focused on the company’s core competencies.
\begin{enumerate}
\item Offshore Outsourcing
\label{sec:orgc5571ed}
Offshore outsourcing is a form of outsourcing in which the services are provided by an organization whose employees are in a \texttt{foreign country.}

\begin{enumerate}
\item Any work done at a relatively high cost in the United States may become a candidate for offshore outsourcing—not just IT work. However, IT professionals in particular can do much of their work anywhere.
\end{enumerate}

As more businesses move their key processes offshore, U.S. IT service providers are forced to lower prices. Many U.S. software firms set up development centers in low-cost foreign countries where they have access to a large pool of well-trained candidates

Organizations must consider many factors when deciding where to locate outsourcing
activities.
\begin{itemize}
\item Political Unrest in foreign country
\item Global Services Location Index
\end{itemize}

\begin{enumerate}
\item Pros of Offshore Outsouring
\label{sec:org498e6ac}
\begin{itemize}
\item Wages that an American worker might consider low represent an excellent salary in many
\end{itemize}
other parts of the world, and some companies feel they would be foolish not to exploit such
an opportunity. Why pay a U.S. IT worker a six-figure salary, they reason, when they can
use offshore outsourcing to hire three India-based workers for the same cost? However, this
attitude might represent a short-term point of view—offshore demand is driving up salaries
in India by roughly 15 percent per year. Because of this, Indian offshore suppliers have
begun to charge more for their services. The cost advantage for offshore outsourcing to India
used to be 6:1 or more—you could hire six Indian IT workers for the cost of one U.S. IT
worker. The cost advantage is shrinking, and once it reaches about 1.5:1, the cost savings
will no longer be much of an incentive for U.S. offshore outsourcing to India.

\begin{itemize}
\item “24-hour workday”
\item 
\end{itemize}
\item Cons of Offshore Outsourcing
\label{sec:org2b64d76}
In addition, organizations often find it takes years of ongoing effort and a large up-front investment to develop a good working relationship with an offshore outsourcing firm. Finding a reputable vendor can be especially difficult for a small or midsized firm that lacks experience in identifying and vetting contractors


The trade-offs between using offshore outsourcing firms and devoting money and time to retain and develop their own staff

Another downside to offshore outsourcing is that a company loses the knowledge and experience gained by outsourced workers when those workers are reassigned after a project’s completion.

Cultural and language differences

The compromising of customer data
\end{enumerate}
\end{enumerate}
