5th-Semester/Business-Ethics/final.org
** Strategies for successful offshore outsouring
The following list provides several tips for companies that are considering offshore
outsourcing:

1. Set clear, firm business specifications for the work to be done.
2. Assess the probability of political upheavals or factors that might interfere with information flow, and ensure the risks are acceptable.
3. Assess the basic stability and economic soundness of the outsourcing vendor and what might occur if the vendor encounters a severe financial downturn.
4. Establish reliable satellite or broadband communications between your site and the outsourcer’s location.
5. Implement a formal version-control process, coordinated through a quality assurance person.
5. Develop and use a dictionary of terms to encourage a common understanding of technical jargon.
7. Require vendors to have project managers at the client site to overcome cultural barriers and facilitate communication with offshore programmers.
8. Require a network manager at the vendor site to coordinate the logistics of using several communications providers around the world.
9. Agree in advance on the structure and content of documentation to ensure that manuals explain how the system was built, as well as how to maintain it.
10. Carefully review a current copy of the outsourcing firm’s SAS No. 70 audit report to ascertain its level of control over information technology and related processes.
** Whitle-blowing
whistle-blowing is an effort to attract public attention to a negligent, illegal, unethical, abusive, or dangerous act by a company or some other organization.

In some cases, whistle-blowers are employees who act as informants on their company, revealing information to enrich themselves or to gain revenge for a perceived wrong. In most cases, however, whistle-blowers act ethically in an attempt to correct what they think is a major wrongdoing, often at great personal risk.
*** Protection of Whistle-blowers
Unfortunately, no comprehensive federal law protects all whistle-blowers from retaliatory acts. Instead, numerous laws protect a certain class of specific whistle-blowing acts in various
industries. To make things even more complicated, each law has different filing provisions, administrative and judicial remedies, and statutes of limitations (which set time limits for
legal action)

From the whistle-blower’s perspective, a short statute of limitations is a major weakness of many whistle-blower protection laws. Failure to comply with the statute of limitations is a favorite defense of firms accused of wrongdoing in whistle-blower case

The ~qui tam~ (“who sues on behalf of the king as well as for himself”) provision of the False Claims Act allows a private citizen to file a suit in the name of the U.S. government, charging fraud by government contractors and other entities who receive or use govern- ment funds. In qui tam actions, the government has the right to intervene and join the legal proceedings. If the government declines, the private plaintiff may proceed alone. Some states have passed similar laws concerning fraud in state government contracts.

The ~False Claims Act~ provides strong whistle-blower protection. Any person who is discharged, demoted, harassed, or otherwise discriminated against because of lawful acts of whistle-blowing is entitled to all relief necessary “to make the employee whole.” Such relief may include job reinstatement; double back pay; and compensation for any special damages, including litigation costs and reasonable attorney’s fees.36
*** Whistle-blowing in private sectors
Under state law, an employee could traditionally be terminated for any reason, or no rea-
son, in the absence of an employment contract. However, many states have created laws
that prevent workers from being fired because of an employee’s participation in “pro-
tected” activities

*** Dealing with a whistleblowing situation
This section provides a general sequence of events, and highlights key issues that a potential whistle-blower should consider.
1. Assess the Seriousness of the Situation
2. Begin Documentation
3. Attempt to Address the Situation Internally
4. Consider Escalating the Situation Within the Company
5. Assess the Implications of Becoming a Whistle-Blower: blow the whistle on the company.
6. Use Experienced Resources to Develop an Action Plan
7. Execute the Action Plan
8. Live with the Consequences
