5th-Semester/Business-Ethics/final.html
<div id="outline-container-orgbaa2083" class="outline-3">
<h3 id="orgbaa2083"><span class="section-number-3">1.5.</span> Strategies for successful offshore outsouring</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The following list provides several tips for companies that are considering offshore
outsourcing:
</p>

<ol class="org-ol">
<li>Set clear, firm business specifications for the work to be done.</li>
<li>Assess the probability of political upheavals or factors that might interfere with information flow, and ensure the risks are acceptable.</li>
<li>Assess the basic stability and economic soundness of the outsourcing vendor and what might occur if the vendor encounters a severe financial downturn.</li>
<li>Establish reliable satellite or broadband communications between your site and the outsourcer’s location.</li>
<li>Implement a formal version-control process, coordinated through a quality assurance person.</li>
<li>Develop and use a dictionary of terms to encourage a common understanding of technical jargon.</li>
<li>Require vendors to have project managers at the client site to overcome cultural barriers and facilitate communication with offshore programmers.</li>
<li>Require a network manager at the vendor site to coordinate the logistics of using several communications providers around the world.</li>
<li>Agree in advance on the structure and content of documentation to ensure that manuals explain how the system was built, as well as how to maintain it.</li>
<li>Carefully review a current copy of the outsourcing firm’s SAS No. 70 audit report to ascertain its level of control over information technology and related processes.</li>
</ol>
</div>
</div>
<div id="outline-container-org8eea47d" class="outline-3">
<h3 id="org8eea47d"><span class="section-number-3">1.6.</span> Whitle-blowing</h3>
<div class="outline-text-3" id="text-1-6">
<p>
whistle-blowing is an effort to attract public attention to a negligent, illegal, unethical, abusive, or dangerous act by a company or some other organization.
</p>

<p>
In some cases, whistle-blowers are employees who act as informants on their company, revealing information to enrich themselves or to gain revenge for a perceived wrong. In most cases, however, whistle-blowers act ethically in an attempt to correct what they think is a major wrongdoing, often at great personal risk.
</p>
</div>
<div id="outline-container-org9624558" class="outline-4">
<h4 id="org9624558"><span class="section-number-4">1.6.1.</span> Protection of Whistle-blowers</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Unfortunately, no comprehensive federal law protects all whistle-blowers from retaliatory acts. Instead, numerous laws protect a certain class of specific whistle-blowing acts in various
industries. To make things even more complicated, each law has different filing provisions, administrative and judicial remedies, and statutes of limitations (which set time limits for
legal action)
</p>

<p>
From the whistle-blower’s perspective, a short statute of limitations is a major weakness of many whistle-blower protection laws. Failure to comply with the statute of limitations is a favorite defense of firms accused of wrongdoing in whistle-blower case
</p>

<p>
The <code>qui tam</code> (“who sues on behalf of the king as well as for himself”) provision of the False Claims Act allows a private citizen to file a suit in the name of the U.S. government, charging fraud by government contractors and other entities who receive or use govern- ment funds. In qui tam actions, the government has the right to intervene and join the legal proceedings. If the government declines, the private plaintiff may proceed alone. Some states have passed similar laws concerning fraud in state government contracts.
</p>

<p>
The <code>False Claims Act</code> provides strong whistle-blower protection. Any person who is discharged, demoted, harassed, or otherwise discriminated against because of lawful acts of whistle-blowing is entitled to all relief necessary “to make the employee whole.” Such relief may include job reinstatement; double back pay; and compensation for any special damages, including litigation costs and reasonable attorney’s fees.36
</p>
</div>
</div>
<div id="outline-container-orgcf523a3" class="outline-4">
<h4 id="orgcf523a3"><span class="section-number-4">1.6.2.</span> Whistle-blowing in private sectors</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
Under state law, an employee could traditionally be terminated for any reason, or no rea-
son, in the absence of an employment contract. However, many states have created laws
that prevent workers from being fired because of an employee’s participation in “pro-
tected” activities
</p>
</div>
</div>

<div id="outline-container-orge80f2fb" class="outline-4">
<h4 id="orge80f2fb"><span class="section-number-4">1.6.3.</span> Dealing with a whistleblowing situation</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
This section provides a general sequence of events, and highlights key issues that a potential whistle-blower should consider.
</p>
<ol class="org-ol">
<li>Assess the Seriousness of the Situation</li>
<li>Begin Documentation</li>
<li>Attempt to Address the Situation Internally</li>
<li>Consider Escalating the Situation Within the Company</li>
<li>Assess the Implications of Becoming a Whistle-Blower: blow the whistle on the company.</li>
<li>Use Experienced Resources to Develop an Action Plan</li>
<li>Execute the Action Plan</li>
<li>Live with the Consequences</li>
</ol>
</div>
</div>
</div>
