5th-Semester/Business-Ethics/final.html
<div id="outline-container-org44585fa" class="outline-3">
<h3 id="org44585fa"><span class="section-number-3">1.7.</span> Green Computing</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Green computing, also known as green technology, is the use of computers and other computing devices and equipment in energy-efficient and eco-friendly ways.
</p>
<ul class="org-ul">
<li>Use less electricity</li>
<li>Less carbon footprint</li>
<li>Reduce the amount of hazardous materials used to produce hardwares</li>
<li>Increase the amount of <code>recyclable</code> materials in its manufacturing and packaging process.</li>
<li>The manufacturers must also help consumers dispose of their products in an environmentally safe manner at the end of their useful life.</li>
</ul>

<p>
EPEAT (Electronic Product Environmental Assessment Tool) is a system that enables purchasers to evaluate, compare, and select electronic products based on 51 environmental criteria.
</p>
</div>
</div>
<div id="outline-container-org82e07f0" class="outline-3">
<h3 id="org82e07f0"><span class="section-number-3">1.8.</span> ICT INDUSTRY CODE OF CONDUCT</h3>
<div class="outline-text-3" id="text-1-8">
<p>
The Electronic Industry Citizenship Coalition (EICC) was established to promote a common code of conduct for the electronics and ICT industry. The following are the five areas of social responsi-
bility and guiding principles covered by the code.
</p>
</div>
<div id="outline-container-org2608b3c" class="outline-4">
<h4 id="org2608b3c"><span class="section-number-4">1.8.1.</span> Labor</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
“Participants are committed to uphold the human rights of workers, and to treat them with dignity and respect as understood by the international community.”
</p>
</div>
</div>

<div id="outline-container-org1fab599" class="outline-4">
<h4 id="org1fab599"><span class="section-number-4">1.8.2.</span> Health and Safety</h4>
<div class="outline-text-4" id="text-1-8-2">
<p>
“Participants recognize that in addition to minimizing the incidence of work-related injury and illness, a safe and healthy work environment enhances the quality of products and services, consistency of production and worker retention and morale. Participants also recognize that
ongoing worker input and education is essential to identifying and solving health and safety issues in the workplace.”
</p>
</div>
</div>

<div id="outline-container-orgd342209" class="outline-4">
<h4 id="orgd342209"><span class="section-number-4">1.8.3.</span> Environmental</h4>
<div class="outline-text-4" id="text-1-8-3">
<p>
“Participants recognize that environmental responsibility is integral to producing world class products. In manufacturing operations, adverse effects on the community, environment, and natural resources are to be minimized while safeguarding the health and safety of the public.”
</p>
</div>
</div>
<div id="outline-container-orgd2e8b6c" class="outline-4">
<h4 id="orgd2e8b6c"><span class="section-number-4">1.8.4.</span> Management System</h4>
<div class="outline-text-4" id="text-1-8-4">
<p>
“Participants shall adopt or establish a management system whose scope is related to the content of this Code. The management system shall be designed to ensure (a) compliance with applicable laws, regulations and customer requirements related to the participant’s operations and products; (b) conformance with this Code; and (c) identification and mitigation of operational risks related to this Code. It should also facilitate continual improvement.”
</p>
</div>
</div>
<div id="outline-container-orgdc4be2c" class="outline-4">
<h4 id="orgdc4be2c"><span class="section-number-4">1.8.5.</span> Ethics</h4>
<div class="outline-text-4" id="text-1-8-5">
<p>
“To meet social responsibilities and to achieve success in the mar- ketplace, participants and their agents are to uphold the highest standards of ethics including: business integrity; no improper advantage; disclosure of information; intellectual property; fair business, advertising, and competition; protection of identity; responsible sourcing of minerals; and privacy.”
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org074e1de" class="outline-2">
<h2 id="org074e1de"><span class="section-number-2">2.</span> Chp 6 - Intellectual Property</h2>
<div class="outline-text-2" id="text-2">
<p>
Intellectual property is a term used to describe works of the mind—such as art, books, films, formulas, inventions, music, and processes—that are distinct and owned or created by a single person or group.
</p>

<p>
Copyright law protects authored works, such as art, books, film, and music.
</p>

<p>
Defining and controlling the appropriate level of access to intellectual property are
complex tasks. For example, protecting computer software has proven to be difficult because
it has not been well categorized under the law. Software has sometimes been treated as the
expression of an idea, which can be protected under copyright law. In other cases, software
has been treated as a process for changing a computer’s internal structure, making it eligible
for protection under patent law. At one time, software was even judged to be a series of
mental steps, making it inappropriate for ownership and ineligible for any form of protectio
</p>
</div>
