5th-Semester/Business-Ethics/final.tex
\subsection{Green Computing}
\label{sec:orge2850f8}
Green computing, also known as green technology, is the use of computers and other computing devices and equipment in energy-efficient and eco-friendly ways.
\begin{itemize}
\item Use less electricity
\item Less carbon footprint
\item Reduce the amount of hazardous materials used to produce hardwares
\item Increase the amount of \texttt{recyclable} materials in its manufacturing and packaging process.
\item The manufacturers must also help consumers dispose of their products in an environmentally safe manner at the end of their useful life.
\end{itemize}

EPEAT (Electronic Product Environmental Assessment Tool) is a system that enables purchasers to evaluate, compare, and select electronic products based on 51 environmental criteria.
\subsection{ICT INDUSTRY CODE OF CONDUCT}
\label{sec:orga0c0ef8}
The Electronic Industry Citizenship Coalition (EICC) was established to promote a common code of conduct for the electronics and ICT industry. The following are the five areas of social responsi-
bility and guiding principles covered by the code.
\subsubsection{Labor}
\label{sec:org693567d}
“Participants are committed to uphold the human rights of workers, and to treat them with dignity and respect as understood by the international community.”

\subsubsection{Health and Safety}
\label{sec:orgb851370}
“Participants recognize that in addition to minimizing the incidence of work-related injury and illness, a safe and healthy work environment enhances the quality of products and services, consistency of production and worker retention and morale. Participants also recognize that
ongoing worker input and education is essential to identifying and solving health and safety issues in the workplace.”

\subsubsection{Environmental}
\label{sec:orgc6f5fa0}
“Participants recognize that environmental responsibility is integral to producing world class products. In manufacturing operations, adverse effects on the community, environment, and natural resources are to be minimized while safeguarding the health and safety of the public.”
\subsubsection{Management System}
\label{sec:org7826e7b}
“Participants shall adopt or establish a management system whose scope is related to the content of this Code. The management system shall be designed to ensure (a) compliance with applicable laws, regulations and customer requirements related to the participant’s operations and products; (b) conformance with this Code; and (c) identification and mitigation of operational risks related to this Code. It should also facilitate continual improvement.”
\subsubsection{Ethics}
\label{sec:orgdabc08e}
“To meet social responsibilities and to achieve success in the mar- ketplace, participants and their agents are to uphold the highest standards of ethics including: business integrity; no improper advantage; disclosure of information; intellectual property; fair business, advertising, and competition; protection of identity; responsible sourcing of minerals; and privacy.”
\section{Chp 6 - Intellectual Property}
\label{sec:org60af3f2}
Intellectual property is a term used to describe works of the mind—such as art, books, films, formulas, inventions, music, and processes—that are distinct and owned or created by a single person or group.

Copyright law protects authored works, such as art, books, film, and music.

Defining and controlling the appropriate level of access to intellectual property are
complex tasks. For example, protecting computer software has proven to be difficult because
it has not been well categorized under the law. Software has sometimes been treated as the
expression of an idea, which can be protected under copyright law. In other cases, software
has been treated as a process for changing a computer’s internal structure, making it eligible
for protection under patent law. At one time, software was even judged to be a series of
mental steps, making it inappropriate for ownership and ineligible for any form of protectio
