5th-Semester/Business-Ethics/final.org
** Copyright
A copyright is the exclusive right to distribute, display, perform, or reproduce an
original work in copies or to prepare derivative works based on the work. Copyright
protection is granted to the creators of “original works of authorship in any tangible
medium of expression, now known or later developed, from which they can be perceived,
reproduced, or otherwise communicated, either directly or with the aid of a machine or
device.

Copyright infringement is a violation of the rights secured by the owner of a copyright.
Infringement occurs when someone copies a substantial and material part of another’s
copyrighted work without permission. The courts have a wide range of discretion in award-
ing damages—from $200 for innocent infringement to $100,000 for willful infringement.


The types of work that can be copyrighted include architecture, art, audiovisual works,
choreography, drama, graphics, literature, motion pictures, music, pantomimes, pictures,
sculptures, sound recordings, and other intellectual works, as described in Title 17 of the
U.S. Code. To be eligible for a copyright, a work must fall within one of the preceding
categories, and it must be original.

However, evaluating the originality of a work is not always a straight-
forward process, and disagreements over whether or not a work is original sometimes lead
to litigation

Some works are not eligible for copyright protection, including those that have not
been fixed in a tangible form of expression (such as an improvisational speech) and those
that consist entirely of common information that contains no original authorship, such as
a chart showing conversions between European and American units of measure.
** Software Copyright Protection Laws
*** The Prioritizing Resources and Organization for Intellectual Property (PRO-IP) Act of 2008
This act increased trademark and copyright enforcement and substantially increased penalties for infringement. The law also created the Office of the United States Intellectual Property Enforcement Representative within the U.S. Department of Justice. One of its programs, called CHIP (Computer Hacking and Intellectual Property), is a network of over 150 experienced and specially trained federal prosecutors who focus on computer and intellectual property crimes.
*** General Agreement on Tariffs and Trade (GATT)
The General Agreement on Tariffs and Trade (GATT) was a multilateral agreement
governing international trade.

It includes a section covering copyrights called the Agreement on Trade-Related Aspects of
Intellectual Property Rights (TRIPS), discussed in the following section.

Despite GATT, however, copyright protection varies greatly from country to country, and an expert should be consulted when considering international usage of any intellectual property.
*** The WTO and the WTO TRIPS Agreement (1994)
The World Trade Organization (WTO) is a global organization that deals with rules of international trade based on WTO agreements that are negotiated and signed by representatives of the world’s trading nations.

Many nations recognize that intellectual property has become increasingly important in world trade, yet the extent of protection and enforcement of intellectual property rights varies around the world. As a result, the WTO developed the Agreement on Trade-Related Aspects of Intellectual Property Rights, also known as the TRIPS Agreement, to establish minimum levels of protection that each government must provide to the intellectual property of all WTO members.
*** The World Intellectual Property Organization (WIPO) Copyright Treaty (1996
The World Intellectual Property Organization (WIPO), headquartered in Geneva, Switzerland, is an agency of the United Nations established in 1967. WIPO is dedicated to “the use of intellectual property as a means to stimulate innovation and creativity.” It has 185 member nations and administers 25 international treaties. Since the 1990s, WIPO has strongly advocated for the interests of intellectual property owners. Its goal is to ensure that intellectual property laws are uniformly administered.
*** The Digital Millennium Copyright Act (1998)
The Digital Millennium Copyright Act (DMCA) was signed into law in 1998 and implements two 1996 WIPO treaties: the WIPO Copyright Treaty and the WIPO Performances and Phonograms Treaty. The act is divided into the following five sections:
