5th-Semester/Business-Ethics/final.html
<li><a id="org9509e42"></a>Title I (WIPO Copyright and Performances and Phonograms Treaties Implementation Act of 1998)<br />
<div class="outline-text-5" id="text-2-2-5-1">
<p>
This section implements the WIPO treaties by making certain technical amendments to U.S. law in order to provide appropriate references and links to the treaties. It also creates two new prohibitions in the Copyright Act (Title 17 of the U.S. Code)—one on circumvention of technological measures used by copyright owners to protect their works and one on tampering with copyright management information. Title I also adds civil remedies and criminal penalties for violating the prohibitions.
</p>
</div>
</li>
<li><a id="org9a11f8b"></a>Title II (Online Copyright Infringement Liability Limitation Act)<br />
<div class="outline-text-5" id="text-2-2-5-2">
<p>
This section enables Web site operators that allow users to post content on their Web site (e.g., music, video, and pictures) to avoid copyright infringement liability if certain “safe harbor” provisions are followed.
</p>
</div>
</li>
<li><a id="org88200b0"></a>Title III (Computer Maintenance Competition Assurance Act)<br />
<div class="outline-text-5" id="text-2-2-5-3">
<p>
This section permits the owner or lessee of a computer to make or authorize the making of a copy of a computer program in the course of maintaining or repairing that computer. The new copy cannot be used in any other manner and must be destroyed immediately after the maintenance or repair is completed.
</p>
</div>
</li>
<li><a id="orge91ac77"></a>Title IV (Miscellaneous provisions)<br />
<div class="outline-text-5" id="text-2-2-5-4">
<p>
This section adds language to the Copyright Act confirming the Copyright Office’s authority to continue to per- form the policy and international functions that it has carried out for decades
under its existing general authority.
</p>
</div>
</li>
<li><a id="orgc30c522"></a>Title V (Vessel Hull Design Protection Act)<br />
<div class="outline-text-5" id="text-2-2-5-5">
<p>
This section creates a new form of protection for the original design of vessel hulls.
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orga23257e" class="outline-3">
<h3 id="orga23257e"><span class="section-number-3">2.3.</span> Patent</h3>
<div class="outline-text-3" id="text-2-3">
<p>
A patent is a grant of a property right issued by the United States Patent and Trademark Office (USPTO) to an inventor.
</p>

<p>
A patent permits its owner to exclude the public from making, using, or selling a protected invention, and it allows for legal action against violators. 
</p>

<p>
Unlike a copyright, a patent prevents independent creation as well as copying. Even if someone else invents the same item independently and with no prior knowledge of the patent holder’s invention, the second inventor is excluded from using the patented device without permission of the original patent holder.
</p>

<p>
A software patent claims as its invention some feature or process embodied in instructions executed by a computer.
</p>

<p>
<code>Patent infringement</code>, or the violation of the rights secured by the owner of a patent, occurs when someone makes unauthorized use of another’s patent. Unlike copyright infringement, there is no specified limit to the monetary penalty if patent infringement is found. In fact, if a court determines that the infringement is intentional, it can award up to three times the amount of the damages claimed by the patent holder. The most common defense against patent infringement is a counterattack on the claim of infringement and the validity of the patent itself. Even if the patent is valid, the plaintiff must still prove that every element of a claim was infringed and that the infringement caused some sort of damage.
</p>
</div>
</div>
<div id="outline-container-org1a20747" class="outline-3">
<h3 id="org1a20747"><span class="section-number-3">2.4.</span> Cross-Licensing Agreements</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Many large software companies have cross-licensing agreements in which each party agrees not to sue the other over patent infringement.
</p>

<p>
Major IT firms usually have little interest in cross-licensing with smaller firms. As a result, small businesses must pay an additional cost from which many larger companies are exempt. Furthermore, small businesses are generally unsuccessful in enforcing their patents against larger companies. Should a small business bring a patent infringement suit against a large firm, the larger firm can overwhelm the small business with multiple patent suits, whether they have merit or not.
</p>
</div>
</div>
<div id="outline-container-org9ba3c27" class="outline-3">
<h3 id="org9ba3c27"><span class="section-number-3">2.5.</span> Trade Secret</h3>
<div class="outline-text-3" id="text-2-5">
<p>
A trade secret was defined as business information that represents something of economic value, has required effort or cost to develop, has some degree of uniqueness or novelty, is generally unknown to the public, and is kept confidential.
</p>

<p>
Trade secret protection begins by identifying all the information that must be protected—from undisclosed patent applications to market research and business plans and developing a comprehensive strategy for keeping the information secure. 
</p>

<p>
Trade secret law protects only against the misappropriation of trade secrets. If competitors come up with the same idea on their own, it is not misappropriation; in other words, the law doesn’t prevent someone from using the same idea if it was developed independently.
</p>
</div>
