5th-Semester/Business-Ethics/final.tex
\item Title I (WIPO Copyright and Performances and Phonograms Treaties Implementation Act of 1998)
\label{sec:org9adb20c}
This section implements the WIPO treaties by making certain technical amendments to U.S. law in order to provide appropriate references and links to the treaties. It also creates two new prohibitions in the Copyright Act (Title 17 of the U.S. Code)—one on circumvention of technological measures used by copyright owners to protect their works and one on tampering with copyright management information. Title I also adds civil remedies and criminal penalties for violating the prohibitions.
\item Title II (Online Copyright Infringement Liability Limitation Act)
\label{sec:org9ea0198}
This section enables Web site operators that allow users to post content on their Web site (e.g., music, video, and pictures) to avoid copyright infringement liability if certain “safe harbor” provisions are followed.
\item Title III (Computer Maintenance Competition Assurance Act)
\label{sec:orgbd4d75e}
This section permits the owner or lessee of a computer to make or authorize the making of a copy of a computer program in the course of maintaining or repairing that computer. The new copy cannot be used in any other manner and must be destroyed immediately after the maintenance or repair is completed.
\item Title IV (Miscellaneous provisions)
\label{sec:org257305c}
This section adds language to the Copyright Act confirming the Copyright Office’s authority to continue to per- form the policy and international functions that it has carried out for decades
under its existing general authority.
\item Title V (Vessel Hull Design Protection Act)
\label{sec:org612fc93}
This section creates a new form of protection for the original design of vessel hulls.
\end{enumerate}
\subsection{Patent}
\label{sec:org9e0a427}
A patent is a grant of a property right issued by the United States Patent and Trademark Office (USPTO) to an inventor.

A patent permits its owner to exclude the public from making, using, or selling a protected invention, and it allows for legal action against violators. 

Unlike a copyright, a patent prevents independent creation as well as copying. Even if someone else invents the same item independently and with no prior knowledge of the patent holder’s invention, the second inventor is excluded from using the patented device without permission of the original patent holder.

A software patent claims as its invention some feature or process embodied in instructions executed by a computer.

\texttt{Patent infringement}, or the violation of the rights secured by the owner of a patent, occurs when someone makes unauthorized use of another’s patent. Unlike copyright infringement, there is no specified limit to the monetary penalty if patent infringement is found. In fact, if a court determines that the infringement is intentional, it can award up to three times the amount of the damages claimed by the patent holder. The most common defense against patent infringement is a counterattack on the claim of infringement and the validity of the patent itself. Even if the patent is valid, the plaintiff must still prove that every element of a claim was infringed and that the infringement caused some sort of damage.
\subsection{Cross-Licensing Agreements}
\label{sec:orge59c265}
Many large software companies have cross-licensing agreements in which each party agrees not to sue the other over patent infringement.

Major IT firms usually have little interest in cross-licensing with smaller firms. As a result, small businesses must pay an additional cost from which many larger companies are exempt. Furthermore, small businesses are generally unsuccessful in enforcing their patents against larger companies. Should a small business bring a patent infringement suit against a large firm, the larger firm can overwhelm the small business with multiple patent suits, whether they have merit or not.
\subsection{Trade Secret}
\label{sec:orgd136d03}
A trade secret was defined as business information that represents something of economic value, has required effort or cost to develop, has some degree of uniqueness or novelty, is generally unknown to the public, and is kept confidential.

Trade secret protection begins by identifying all the information that must be protected—from undisclosed patent applications to market research and business plans and developing a comprehensive strategy for keeping the information secure. 

Trade secret law protects only against the misappropriation of trade secrets. If competitors come up with the same idea on their own, it is not misappropriation; in other words, the law doesn’t prevent someone from using the same idea if it was developed independently.
