5th-Semester/Business-Ethics/final.html
<div id="outline-container-orgec71b47" class="outline-4">
<h4 id="orgec71b47"><span class="section-number-4">2.5.1.</span> Employee &amp; Trade Secrets</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Employees are the greatest threat to the loss of company trade secrets—they might accidentally disclose trade secrets or steal them for monetary gain.
</p>

<ol class="org-ol">
<li>Organizations must <code>educate</code> employees about the importance of maintaining the secrecy of corporate information.</li>
<li>Trade secret information should be labeled clearly as confidential and should only be accessible by a limited number of people.</li>
<li>Most organizations have strict policies regarding <code>nondisclosure</code> of corporate information.</li>
<li>Because organizations can risk losing trade secrets when <code>key employees leave</code>, they often try to prohibit employees from revealing secrets by adding nondisclosure clauses to employment contracts. Thus, departing employees <code>cannot take copies of computer programs or reveal the details of software owned by the firm.</code></li>
<li>Another option for preserving trade secrets is to have an <code>experienced member of the Human Resources Department</code> conduct an exit interview with each departing employee. A key step in the interview is to review a checklist that deals with confidentiality issues. At the end of the interview, the departing employee is asked to sign an acknowledgment of responsibility not to divulge any trade secrets.</li>
</ol>
</div>
</div>
<div id="outline-container-org7466608" class="outline-4">
<h4 id="org7466608"><span class="section-number-4">2.5.2.</span> Steps to protect trade secret</h4>
<div class="outline-text-4" id="text-2-5-2">
<ol class="org-ol">
<li>Human resources involved should have sufficient knowledge to understand what is trade secret and waht is not.</li>
<li>Involved personnel should alert the involved in thread circumstances. That is immediate decision.</li>
<li>Internal policy should be well-communicated.</li>
<li>Using non-disclosure or acknowledgement to not divulge trade secret at employee departure.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge974c20" class="outline-3">
<h3 id="orge974c20"><span class="section-number-3">2.6.</span> Trade Secret Laws</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-org967416f" class="outline-4">
<h4 id="org967416f"><span class="section-number-4">2.6.1.</span> Uniform Trade Secrets Act (UTSA)</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
The Uniform Trade Secrets Act (UTSA) was drafted in the 1970s to bring uniformity to all the United States in the area of trade secret law.
</p>
</div>
</div>
<div id="outline-container-org5e2a6cb" class="outline-4">
<h4 id="org5e2a6cb"><span class="section-number-4">2.6.2.</span> The Economic Espionage Act (EEA) (1996)</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
The Economic Espionage Act (EEA) of 1996 imposes penalties of up to $10 million and 15 years in prison for the theft of trade secrets. Before the EEA, there was no specific criminal statute to help pursue economic espionage;
</p>

<p>
Espionage is the activity of finding out the political, military, or industrial secrets of your enemies or rivals by using spies. 
</p>
</div>
</div>
</div>
<div id="outline-container-org2b15f62" class="outline-3">
<h3 id="org2b15f62"><span class="section-number-3">2.7.</span> KEY INTELLECTUAL PROPERTY ISSUES</h3>
<div class="outline-text-3" id="text-2-7">
<p>
This section discusses several issues that apply to intellectual property and information technology.
</p>
</div>
<div id="outline-container-org6bb14a5" class="outline-4">
<h4 id="org6bb14a5"><span class="section-number-4">2.7.1.</span> Plagiarism</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
Plagiarism is the act of stealing someone’s ideas or words and passing them off as one’s own. The explosion of electronic content and the growth of the Web have made it easy to cut and paste paragraphs into term papers and other documents without proper citation or quotation marks.
</p>

<p>
Educate people on citations.
</p>
</div>
</div>
<div id="outline-container-org6203251" class="outline-4">
<h4 id="org6203251"><span class="section-number-4">2.7.2.</span> Reverse Engineering</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
Reverse engineering is the process of taking something apart in order to understand it, build a copy of it, or improve it. Reverse engineering was originally applied to computer hardware but is now commonly applied to software as well.
The use of reverse engineering, saying it can uncover software designs that someone else has developed at great cost and taken care to protect. Opponents of reverse engineering contend it unfairly robs the creator of future earnings and significantly reduces the business incentive for software development.
</p>
</div>
</div>
<div id="outline-container-org4cc84ba" class="outline-4">
<h4 id="org4cc84ba"><span class="section-number-4">2.7.3.</span> Open Source Code</h4>
<div class="outline-text-4" id="text-2-7-3">
<p>
Open source code is any program whose source code is made available for use or modification, as users or other developers see fit. The basic premise behind open source code is that when many programmers can read, redistribute, and modify a program’s code, the software improves.
</p>

<p>
A software developer could attempt to make a program open source simply by putting it into the public domain with no copyright. This would allow people to share the program and their improvements, but it would also allow others to revise the original code and then distribute the resulting software as their own proprietary product. Users who received the program in the modified form would no longer have the free- doms associated with the original software. Use of an open source license avoids this scenario.
</p>
</div>
</div>
