5th-Semester/Business-Ethics/final.tex
\subsubsection{Employee \& Trade Secrets}
\label{sec:orgd79b243}
Employees are the greatest threat to the loss of company trade secrets—they might accidentally disclose trade secrets or steal them for monetary gain.

\begin{enumerate}
\item Organizations must \texttt{educate} employees about the importance of maintaining the secrecy of corporate information.
\item Trade secret information should be labeled clearly as confidential and should only be accessible by a limited number of people.
\item Most organizations have strict policies regarding \texttt{nondisclosure} of corporate information.
\item Because organizations can risk losing trade secrets when \texttt{key employees leave}, they often try to prohibit employees from revealing secrets by adding nondisclosure clauses to employment contracts. Thus, departing employees \texttt{cannot take copies of computer programs or reveal the details of software owned by the firm.}
\item Another option for preserving trade secrets is to have an \texttt{experienced member of the Human Resources Department} conduct an exit interview with each departing employee. A key step in the interview is to review a checklist that deals with confidentiality issues. At the end of the interview, the departing employee is asked to sign an acknowledgment of responsibility not to divulge any trade secrets.
\end{enumerate}
\subsubsection{Steps to protect trade secret}
\label{sec:org116d6c0}
\begin{enumerate}
\item Human resources involved should have sufficient knowledge to understand what is trade secret and waht is not.
\item Involved personnel should alert the involved in thread circumstances. That is immediate decision.
\item Internal policy should be well-communicated.
\item Using non-disclosure or acknowledgement to not divulge trade secret at employee departure.
\end{enumerate}
\subsection{Trade Secret Laws}
\label{sec:orgc930a71}
\subsubsection{Uniform Trade Secrets Act (UTSA)}
\label{sec:org5beed95}
The Uniform Trade Secrets Act (UTSA) was drafted in the 1970s to bring uniformity to all the United States in the area of trade secret law.
\subsubsection{The Economic Espionage Act (EEA) (1996)}
\label{sec:orgb769cec}
The Economic Espionage Act (EEA) of 1996 imposes penalties of up to \$10 million and 15 years in prison for the theft of trade secrets. Before the EEA, there was no specific criminal statute to help pursue economic espionage;

Espionage is the activity of finding out the political, military, or industrial secrets of your enemies or rivals by using spies. 
\subsection{KEY INTELLECTUAL PROPERTY ISSUES}
\label{sec:orge88874d}
This section discusses several issues that apply to intellectual property and information technology.
\subsubsection{Plagiarism}
\label{sec:orgee6784b}
Plagiarism is the act of stealing someone’s ideas or words and passing them off as one’s own. The explosion of electronic content and the growth of the Web have made it easy to cut and paste paragraphs into term papers and other documents without proper citation or quotation marks.

Educate people on citations.
\subsubsection{Reverse Engineering}
\label{sec:org86da48f}
Reverse engineering is the process of taking something apart in order to understand it, build a copy of it, or improve it. Reverse engineering was originally applied to computer hardware but is now commonly applied to software as well.
The use of reverse engineering, saying it can uncover software designs that someone else has developed at great cost and taken care to protect. Opponents of reverse engineering contend it unfairly robs the creator of future earnings and significantly reduces the business incentive for software development.
\subsubsection{Open Source Code}
\label{sec:org16a0933}
Open source code is any program whose source code is made available for use or modification, as users or other developers see fit. The basic premise behind open source code is that when many programmers can read, redistribute, and modify a program’s code, the software improves.

A software developer could attempt to make a program open source simply by putting it into the public domain with no copyright. This would allow people to share the program and their improvements, but it would also allow others to revise the original code and then distribute the resulting software as their own proprietary product. Users who received the program in the modified form would no longer have the free- doms associated with the original software. Use of an open source license avoids this scenario.
