5th-Semester/Business-Ethics/final.html
<div id="outline-container-org7e79b28" class="outline-4">
<h4 id="org7e79b28"><span class="section-number-4">2.7.4.</span> Competitive Intelligence</h4>
<div class="outline-text-4" id="text-2-7-4">
<p>
Competitive intelligence (as defined in Chapter 3) is legally obtained information that is gathered to help a company gain an advantage over its rivals. For example, some companies have employees who monitor the public announcements of property transfers to detect any plant or store expansions of competitors. An effective competitive intelligence program requires the continual gathering, analysis, and evaluation of data with controlled dissemination of useful information to decision makers.
</p>

<p>
Competitive intelligence is not the same as industrial espionage, which is the use of illegal means to obtain business information not available to the general public.
</p>

<p>
Competitive intelligence analysts must avoid unethical or illegal actions, such as lying,
misrepresentation, theft, bribery, or eavesdropping with illegal devices.
</p>
</div>
</div>
<div id="outline-container-org987885d" class="outline-4">
<h4 id="org987885d"><span class="section-number-4">2.7.5.</span> Trademark Infringement</h4>
<div class="outline-text-4" id="text-2-7-5">
<p>
A trademark is a logo, package design, phrase, sound, or word that enables a consumer to differentiate one company’s products from another’s
</p>
</div>
</div>
<div id="outline-container-org04726a1" class="outline-4">
<h4 id="org04726a1"><span class="section-number-4">2.7.6.</span> Cybersquatting</h4>
<div class="outline-text-4" id="text-2-7-6">
<p>
Companies that want to establish an online presence know that the best way to capitalize on the strengths of their brand names and trademarks is to make the names part of the domain names for their Web sites. When Web sites were first established, there was no procedure for validating the legitimacy of requests for Web site names.
</p>

<p>
The main tactic organizations use to circumvent cybersquatting is to protect a trademark by registering numerous domain names and variations as soon as the organization knows it wants to develop a Web presence.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org357bb9a" class="outline-2">
<h2 id="org357bb9a"><span class="section-number-2">3.</span> Chp 3 - Computer &amp; Internet Crime</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb344442" class="outline-3">
<h3 id="orgb344442"><span class="section-number-3">3.1.</span> Why Computer Incidents Are So Prevalent?</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Increasing Complexity Increases Vulnerability</li>
<li>Higher Computer User Expectations</li>
<li>Expanding and Changing Systems Introduce New Risks</li>
<li>Bring Your Own Device</li>
<li>Increased Reliance on Commercial Software with Known Vulnerabilities</li>
</ol>
</div>
</div>
<div id="outline-container-org6731d5a" class="outline-3">
<h3 id="org6731d5a"><span class="section-number-3">3.2.</span> Prevention</h3>
<div class="outline-text-3" id="text-3-2">
<p>
AST MUN
</p>
<ol class="org-ol">
<li>Conduct vulnerability <code>assessment</code>!</li>
<li>Strong security measures: IDS, access control</li>
<li>Train employees on security best practices</li>
<li>Monitor network activity</li>
<li>Up-to-date softwares</li>
<li>Use network segmentation</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org9049393" class="outline-2">
<h2 id="org9049393"><span class="section-number-2">4.</span> Chp 2 - forgot name</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://docs.google.com/document/d/1TBkps7-DH7TuaZY-rTWYsV1zgnPnBVwf8500eHXIdLg/edit?usp=sharing">Source</a>
</p>
</div>
<div id="outline-container-org88d5040" class="outline-3">
<h3 id="org88d5040"><span class="section-number-3">4.1.</span> What is professionalism? Are IT Workers Professional?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Professionalism: A profession is a calling that requires specialized knowledge and often long intensive academic preparation.
</p>

<p>
IT workers require intensive training, continuous learning with changing techstacks and a key role is in their experience. And so IT Workers are also professionals.
</p>

<p>
Many business workers have <code>duties, backgrounds, and training</code> that qualify them to be classified as professionals, including marketing analysts, financial consultants, and IT specialists such as mobile application developers, software engineers, systems analysts, and network administrators.
</p>

<p>
One could argue, however, that not every IT role requires <code>“knowledge of an advanced type in a field of science or learning customarily acquired by a prolonged course of specialized intellectual instruction and study,”</code> to quote again from the United States Code. From a legal perspective, IT workers are not recognized as professionals because they are not licensed by the state or federal government. This distinction is important, for example, in malpractice lawsuits, as many courts have ruled that IT workers are not liable for malpractice because they do not meet the legal definition of a professional.
</p>
</div>
</div>
<div id="outline-container-orgece3d47" class="outline-3">
<h3 id="orgece3d47"><span class="section-number-3">4.2.</span> Relationship between IT workers and client</h3>
<div class="outline-text-3" id="text-4-2">
<p>
IT workers provide services to clients; sometimes those “clients” are coworkers who are part of the same organization as the IT worker. In other cases, the client is part of a different organization.
</p>

<p>
Typically, the client makes decisions about a project on the basis of information, alternatives, and recommendations provided by the IT worker. The client trusts the IT worker to use his or her expertise and to act in the client’s best interests. The IT worker must trust that the client will provide relevant information, listen to and understand what the IT worker says, ask questions to understand the impact of key decisions, and use the information to make wise choices among various alternatives. Thus, the responsibility for decision making is shared between client and IT workers.
</p>
</div>
