5th-Semester/Business-Ethics/final.tex
\subsubsection{Competitive Intelligence}
\label{sec:org24227d5}
Competitive intelligence (as defined in Chapter 3) is legally obtained information that is gathered to help a company gain an advantage over its rivals. For example, some companies have employees who monitor the public announcements of property transfers to detect any plant or store expansions of competitors. An effective competitive intelligence program requires the continual gathering, analysis, and evaluation of data with controlled dissemination of useful information to decision makers.

Competitive intelligence is not the same as industrial espionage, which is the use of illegal means to obtain business information not available to the general public.

Competitive intelligence analysts must avoid unethical or illegal actions, such as lying,
misrepresentation, theft, bribery, or eavesdropping with illegal devices.
\subsubsection{Trademark Infringement}
\label{sec:org45fc0ce}
A trademark is a logo, package design, phrase, sound, or word that enables a consumer to differentiate one company’s products from another’s
\subsubsection{Cybersquatting}
\label{sec:org1df2c6b}
Companies that want to establish an online presence know that the best way to capitalize on the strengths of their brand names and trademarks is to make the names part of the domain names for their Web sites. When Web sites were first established, there was no procedure for validating the legitimacy of requests for Web site names.

The main tactic organizations use to circumvent cybersquatting is to protect a trademark by registering numerous domain names and variations as soon as the organization knows it wants to develop a Web presence.
\section{Chp 3 - Computer \& Internet Crime}
\label{sec:orgab91cc3}
\subsection{Why Computer Incidents Are So Prevalent?}
\label{sec:org919dfa4}
\begin{enumerate}
\item Increasing Complexity Increases Vulnerability
\item Higher Computer User Expectations
\item Expanding and Changing Systems Introduce New Risks
\item Bring Your Own Device
\item Increased Reliance on Commercial Software with Known Vulnerabilities
\end{enumerate}
\subsection{Prevention}
\label{sec:org5c5c1f8}
AST MUN
\begin{enumerate}
\item Conduct vulnerability \texttt{assessment}!
\item Strong security measures: IDS, access control
\item Train employees on security best practices
\item Monitor network activity
\item Up-to-date softwares
\item Use network segmentation
\end{enumerate}
\section{Chp 2 - forgot name}
\label{sec:org486252c}
\href{https://docs.google.com/document/d/1TBkps7-DH7TuaZY-rTWYsV1zgnPnBVwf8500eHXIdLg/edit?usp=sharing}{Source}
\subsection{What is professionalism? Are IT Workers Professional?}
\label{sec:org5a95246}
Professionalism: A profession is a calling that requires specialized knowledge and often long intensive academic preparation.

IT workers require intensive training, continuous learning with changing techstacks and a key role is in their experience. And so IT Workers are also professionals.

Many business workers have \texttt{duties, backgrounds, and training} that qualify them to be classified as professionals, including marketing analysts, financial consultants, and IT specialists such as mobile application developers, software engineers, systems analysts, and network administrators.

One could argue, however, that not every IT role requires \texttt{“knowledge of an advanced type in a field of science or learning customarily acquired by a prolonged course of specialized intellectual instruction and study,”} to quote again from the United States Code. From a legal perspective, IT workers are not recognized as professionals because they are not licensed by the state or federal government. This distinction is important, for example, in malpractice lawsuits, as many courts have ruled that IT workers are not liable for malpractice because they do not meet the legal definition of a professional.
\subsection{Relationship between IT workers and client}
\label{sec:org653c3a4}
IT workers provide services to clients; sometimes those “clients” are coworkers who are part of the same organization as the IT worker. In other cases, the client is part of a different organization.

Typically, the client makes decisions about a project on the basis of information, alternatives, and recommendations provided by the IT worker. The client trusts the IT worker to use his or her expertise and to act in the client’s best interests. The IT worker must trust that the client will provide relevant information, listen to and understand what the IT worker says, ask questions to understand the impact of key decisions, and use the information to make wise choices among various alternatives. Thus, the responsibility for decision making is shared between client and IT workers.
