5th-Semester/Business-Ethics/final.org
*** Potential Issues
- Conflict of Interest
- Schedeule issues: Problems can also arise during a project if IT workers find themselves unable to provide full and accurate reporting of the project’s status due to a lack of information, tools, or experience needed to perform an accurate assessment. The project manager may want to keep resources flowing into the project and hope that problems can be corrected before anyone notices. The project manager may also be reluctant to share status information because of contractual penalties for failure to meet the schedule or to develop certain sys- tem functions. In such a situation, the client may not be informed about a problem until it has become a crisis.
- Fraud
- Misrepresentation
- Breach of contract
** Relationships Between IT Workers and Suppliers
IT workers deal with many different hardware, software, and service providers. Most IT workers understand that building a good working relationship with suppliers encourages the flow of useful communication as well as the sharing of ideas. Such information can lead to innovative and cost-effective ways of using the supplier’s products and services that the IT worker may never have considered.
IT workers can develop good relationships with suppliers by dealing fairly with them and not making unreasonable demands. Threatening to replace a supplier who can’t deliver needed equipment tomorrow, when the normal industry lead time is one week, is aggressive behavior that does not help build a good working relationship.

Potential Issues:
- Bribery
** Relationships Between IT Workers and Other Professionals
Professionals often feel a degree of loyalty to the other members of their profession. As a result, they are often quick to help each other obtain new positions but slow to criticize each other in public.

- Resume Inflation
- Preferential Treatment
** Relationships between IT Workers and IT Users
IT workers also have a key responsibility to establish an environment that supports ethical behavior by users. Such an environment discourages 
- software piracy
- minimizes the inappropriate use of corporate computing resources
- avoids the inappropriate sharing of information
** Relationships Between IT Workers and Society
Societyy expects members of a profession to provide significant benefits and to not cause harm
through their actions. One approach to meeting this expectation is to establish and maintain professional standards that protect the public.
** Certification
Certification indicates that a professional possesses a particular set of skills, knowledge, or abilities, in the opinion of the certifying organization.
Is certification relevant to your current job or the one to which you aspire? Does the company offering the certification have a good reputation? What is the current and potential future demand for skills in this area of certification?
*** Vendor Certifications
Many IT vendors—such as Cisco, IBM, Microsoft, SAP, and Oracle—offer certification programs for those who use their products.
*** Industry Association Certifications
There are many available industry certifications in a variety of IT-related subject areas. Their value varies greatly depending on where people are in their career path, what other certifications they possess, and the nature of the IT job market.

CompTIA A+, Red Hat Linux Certification
** Compliance
Compliance means to be in accordance with established policies, guidelines, specifications, or legislation.

- Audit Committee
- Internal Audit Department
** What is professionalism? Are IT Workers professional?
Professionalism: A profession is a calling that requires specialized knowledge and often long intensive academic preparation.

IT workers require intensive training, continuous learning with changing techstacks and a key role is in their experience. And so IT Workers are also professionals.
