5th-Semester/Business-Ethics/final.html

<div id="outline-container-org9700b5c" class="outline-4">
<h4 id="org9700b5c"><span class="section-number-4">4.2.1.</span> Potential Issues</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li>Conflict of Interest</li>
<li>Schedeule issues: Problems can also arise during a project if IT workers find themselves unable to provide full and accurate reporting of the project’s status due to a lack of information, tools, or experience needed to perform an accurate assessment. The project manager may want to keep resources flowing into the project and hope that problems can be corrected before anyone notices. The project manager may also be reluctant to share status information because of contractual penalties for failure to meet the schedule or to develop certain sys- tem functions. In such a situation, the client may not be informed about a problem until it has become a crisis.</li>
<li>Fraud</li>
<li>Misrepresentation</li>
<li>Breach of contract</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcc70a43" class="outline-3">
<h3 id="orgcc70a43"><span class="section-number-3">4.3.</span> Relationships Between IT Workers and Suppliers</h3>
<div class="outline-text-3" id="text-4-3">
<p>
IT workers deal with many different hardware, software, and service providers. Most IT workers understand that building a good working relationship with suppliers encourages the flow of useful communication as well as the sharing of ideas. Such information can lead to innovative and cost-effective ways of using the supplier’s products and services that the IT worker may never have considered.
IT workers can develop good relationships with suppliers by dealing fairly with them and not making unreasonable demands. Threatening to replace a supplier who can’t deliver needed equipment tomorrow, when the normal industry lead time is one week, is aggressive behavior that does not help build a good working relationship.
</p>

<p>
Potential Issues:
</p>
<ul class="org-ul">
<li>Bribery</li>
</ul>
</div>
</div>
<div id="outline-container-org0962374" class="outline-3">
<h3 id="org0962374"><span class="section-number-3">4.4.</span> Relationships Between IT Workers and Other Professionals</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Professionals often feel a degree of loyalty to the other members of their profession. As a result, they are often quick to help each other obtain new positions but slow to criticize each other in public.
</p>

<ul class="org-ul">
<li>Resume Inflation</li>
<li>Preferential Treatment</li>
</ul>
</div>
</div>
<div id="outline-container-orgb0300c1" class="outline-3">
<h3 id="orgb0300c1"><span class="section-number-3">4.5.</span> Relationships between IT Workers and IT Users</h3>
<div class="outline-text-3" id="text-4-5">
<p>
IT workers also have a key responsibility to establish an environment that supports ethical behavior by users. Such an environment discourages 
</p>
<ul class="org-ul">
<li>software piracy</li>
<li>minimizes the inappropriate use of corporate computing resources</li>
<li>avoids the inappropriate sharing of information</li>
</ul>
</div>
</div>
<div id="outline-container-org0fe3c15" class="outline-3">
<h3 id="org0fe3c15"><span class="section-number-3">4.6.</span> Relationships Between IT Workers and Society</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Societyy expects members of a profession to provide significant benefits and to not cause harm
through their actions. One approach to meeting this expectation is to establish and maintain professional standards that protect the public.
</p>
</div>
</div>
<div id="outline-container-org6dbb765" class="outline-3">
<h3 id="org6dbb765"><span class="section-number-3">4.7.</span> Certification</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Certification indicates that a professional possesses a particular set of skills, knowledge, or abilities, in the opinion of the certifying organization.
Is certification relevant to your current job or the one to which you aspire? Does the company offering the certification have a good reputation? What is the current and potential future demand for skills in this area of certification?
</p>
</div>
<div id="outline-container-orgf5007a3" class="outline-4">
<h4 id="orgf5007a3"><span class="section-number-4">4.7.1.</span> Vendor Certifications</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
Many IT vendors—such as Cisco, IBM, Microsoft, SAP, and Oracle—offer certification programs for those who use their products.
</p>
</div>
</div>
<div id="outline-container-org90ba441" class="outline-4">
<h4 id="org90ba441"><span class="section-number-4">4.7.2.</span> Industry Association Certifications</h4>
<div class="outline-text-4" id="text-4-7-2">
<p>
There are many available industry certifications in a variety of IT-related subject areas. Their value varies greatly depending on where people are in their career path, what other certifications they possess, and the nature of the IT job market.
</p>

<p>
CompTIA A+, Red Hat Linux Certification
</p>
</div>
</div>
</div>
<div id="outline-container-org27c857e" class="outline-3">
<h3 id="org27c857e"><span class="section-number-3">4.8.</span> Compliance</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Compliance means to be in accordance with established policies, guidelines, specifications, or legislation.
</p>

<ul class="org-ul">
<li>Audit Committee</li>
<li>Internal Audit Department</li>
</ul>
</div>
</div>
