5th-Semester/Business-Ethics/final.tex

\subsubsection{Potential Issues}
\label{sec:org26a17d2}
\begin{itemize}
\item Conflict of Interest
\item Schedeule issues: Problems can also arise during a project if IT workers find themselves unable to provide full and accurate reporting of the project’s status due to a lack of information, tools, or experience needed to perform an accurate assessment. The project manager may want to keep resources flowing into the project and hope that problems can be corrected before anyone notices. The project manager may also be reluctant to share status information because of contractual penalties for failure to meet the schedule or to develop certain sys- tem functions. In such a situation, the client may not be informed about a problem until it has become a crisis.
\item Fraud
\item Misrepresentation
\item Breach of contract
\end{itemize}
\subsection{Relationships Between IT Workers and Suppliers}
\label{sec:org954db97}
IT workers deal with many different hardware, software, and service providers. Most IT workers understand that building a good working relationship with suppliers encourages the flow of useful communication as well as the sharing of ideas. Such information can lead to innovative and cost-effective ways of using the supplier’s products and services that the IT worker may never have considered.
IT workers can develop good relationships with suppliers by dealing fairly with them and not making unreasonable demands. Threatening to replace a supplier who can’t deliver needed equipment tomorrow, when the normal industry lead time is one week, is aggressive behavior that does not help build a good working relationship.

Potential Issues:
\begin{itemize}
\item Bribery
\end{itemize}
\subsection{Relationships Between IT Workers and Other Professionals}
\label{sec:org8023049}
Professionals often feel a degree of loyalty to the other members of their profession. As a result, they are often quick to help each other obtain new positions but slow to criticize each other in public.

\begin{itemize}
\item Resume Inflation
\item Preferential Treatment
\end{itemize}
\subsection{Relationships between IT Workers and IT Users}
\label{sec:orgc73bcd1}
IT workers also have a key responsibility to establish an environment that supports ethical behavior by users. Such an environment discourages 
\begin{itemize}
\item software piracy
\item minimizes the inappropriate use of corporate computing resources
\item avoids the inappropriate sharing of information
\end{itemize}
\subsection{Relationships Between IT Workers and Society}
\label{sec:org411e681}
Societyy expects members of a profession to provide significant benefits and to not cause harm
through their actions. One approach to meeting this expectation is to establish and maintain professional standards that protect the public.
\subsection{Certification}
\label{sec:org685268f}
Certification indicates that a professional possesses a particular set of skills, knowledge, or abilities, in the opinion of the certifying organization.
Is certification relevant to your current job or the one to which you aspire? Does the company offering the certification have a good reputation? What is the current and potential future demand for skills in this area of certification?
\subsubsection{Vendor Certifications}
\label{sec:org7a15c74}
Many IT vendors—such as Cisco, IBM, Microsoft, SAP, and Oracle—offer certification programs for those who use their products.
\subsubsection{Industry Association Certifications}
\label{sec:org8ff85e0}
There are many available industry certifications in a variety of IT-related subject areas. Their value varies greatly depending on where people are in their career path, what other certifications they possess, and the nature of the IT job market.

CompTIA A+, Red Hat Linux Certification
\subsection{Compliance}
\label{sec:orgaaaf485}
Compliance means to be in accordance with established policies, guidelines, specifications, or legislation.

\begin{itemize}
\item Audit Committee
\item Internal Audit Department
\end{itemize}
