5th-Semester/Business-Ethics/final.org
** Issues in Employer Relationships/ Relationship between IT Worker & Professional
The employer and IT worker have a critical and multifaceted relationship that requires ongoing efforts by both parties to keep it strong. An IT worker and an employer typically agree on fundamental aspects of these relationships before the IT worker accepts an employment offer.
 
There are some issues in the employer relationship. These issues may include: Job Title, General performance expectations, specific work responsibilities, drug testing, dress code, location of employment, salary, work hour & company benefits. Some aspects are specific to the role of IT workers and are estimated based on the nature of the work or project. For example, the programming language to be used, the type and amount of documentation to be produced and the extent of testing to be conducted.

Memorize:
Job Title
specific work responsibilities
salary
work hour
General performance expectations
company benefits.
drug testing
dress code
location of employment
*** Trade Secret
IT workers should not divulge company secrets. A secret can be SRS, software design, source code, vulnerability testing report etc. 
*** Software Business Alliance
The Business Software Alliance (BSA) is a trade group that represents the world’s largest software and hardware manufacturers. Its mission is to stop the unauthorized copying of software produced by its members. 
*** Whistleblowers
Whistle-blowing is an effort by an employee to attract attention to a negligent, illegal, unethical, abusive, or dangerous act by a company that threatens the public interest
** Professional Relationships that must be maintained
Software engineering is a people intensive industry so maintaining good relationships is necessary.

** What is a professional code of ethics? Discuss about its 4 fundamental principles.
A professional code of ethics states the principles and core values that are essential to the work of a particular occupational group. Practitioners in many professions subscribe to a code of ethics that governs their behavior.

There are 4 fundamental principles of professional code of ethics. They are:
1. Ethical decision making
2. High standard of practice and ethical behavior
3. Trust and respect from the general public
4. Evaluation Benchmark
** What are IT Professional Organizations? List some of the organizations and their roles.
These organizations disseminate information through email, periodicals, Web sites, meetings, and conferences. Furthermore, in recognition of the need for professional standards of competence and conduct, many of these organizations have developed codes of ethics.

*** Association for Computing Machinery (ACM): 
- publishes over 50 journals and magazines and 30 newsletters
- offers a substantial digital library of bibliographic information, citations, articles, and journals
- 37 special-interest groups (SIGs) representing major areas of computing
*** Institute of Electrical and Electronics Engineers Computer Society (IEEE-CS):
- covers the broad fields of electrical, electronic, and information technologies and science. 
- helps meet the information and career development needs of computing researchers and practitioners with technical journals, magazines, books, conferences, conference publications, and online courses.
- offers a Certified Software Development Professional (CSDP) program for experienced professionals and a Certified Software Development Associate(CSDA) credential for recent college graduates
- Sponsors conferences
*** Association of Information Technology Professionals (AITP):
- provides IT-related seminars and conferences, information on IT issues, and forums for networking with other IT workers.
- mission is to provide superior leadership and education in information technology
help members make themselves more marketable within their industry
-  Has a code of ethics and standards of conducts
