5th-Semester/Business-Ethics/final.html
<div id="outline-container-org3a7196b" class="outline-3">
<h3 id="org3a7196b"><span class="section-number-3">4.9.</span> What is professionalism? Are IT Workers professional?</h3>
<div class="outline-text-3" id="text-4-9">
<p>
Professionalism: A profession is a calling that requires specialized knowledge and often long intensive academic preparation.
</p>

<p>
IT workers require intensive training, continuous learning with changing techstacks and a key role is in their experience. And so IT Workers are also professionals.
</p>
</div>
</div>
<div id="outline-container-org8c604d5" class="outline-3">
<h3 id="org8c604d5"><span class="section-number-3">4.10.</span> Issues in Employer Relationships/ Relationship between IT Worker &amp; Professional</h3>
<div class="outline-text-3" id="text-4-10">
<p>
The employer and IT worker have a critical and multifaceted relationship that requires ongoing efforts by both parties to keep it strong. An IT worker and an employer typically agree on fundamental aspects of these relationships before the IT worker accepts an employment offer.
</p>

<p>
There are some issues in the employer relationship. These issues may include: Job Title, General performance expectations, specific work responsibilities, drug testing, dress code, location of employment, salary, work hour &amp; company benefits. Some aspects are specific to the role of IT workers and are estimated based on the nature of the work or project. For example, the programming language to be used, the type and amount of documentation to be produced and the extent of testing to be conducted.
</p>

<p>
Memorize:
Job Title
specific work responsibilities
salary
work hour
General performance expectations
company benefits.
drug testing
dress code
location of employment
</p>
</div>
<div id="outline-container-org19a2ba8" class="outline-4">
<h4 id="org19a2ba8"><span class="section-number-4">4.10.1.</span> Trade Secret</h4>
<div class="outline-text-4" id="text-4-10-1">
<p>
IT workers should not divulge company secrets. A secret can be SRS, software design, source code, vulnerability testing report etc. 
</p>
</div>
</div>
<div id="outline-container-org1b744a9" class="outline-4">
<h4 id="org1b744a9"><span class="section-number-4">4.10.2.</span> Software Business Alliance</h4>
<div class="outline-text-4" id="text-4-10-2">
<p>
The Business Software Alliance (BSA) is a trade group that represents the world’s largest software and hardware manufacturers. Its mission is to stop the unauthorized copying of software produced by its members. 
</p>
</div>
</div>
<div id="outline-container-orgb03b937" class="outline-4">
<h4 id="orgb03b937"><span class="section-number-4">4.10.3.</span> Whistleblowers</h4>
<div class="outline-text-4" id="text-4-10-3">
<p>
Whistle-blowing is an effort by an employee to attract attention to a negligent, illegal, unethical, abusive, or dangerous act by a company that threatens the public interest
</p>
</div>
</div>
</div>
<div id="outline-container-org8844df6" class="outline-3">
<h3 id="org8844df6"><span class="section-number-3">4.11.</span> Professional Relationships that must be maintained</h3>
<div class="outline-text-3" id="text-4-11">
<p>
Software engineering is a people intensive industry so maintaining good relationships is necessary.
</p>
</div>
</div>

<div id="outline-container-orgf177b45" class="outline-3">
<h3 id="orgf177b45"><span class="section-number-3">4.12.</span> What is a professional code of ethics? Discuss about its 4 fundamental principles.</h3>
<div class="outline-text-3" id="text-4-12">
<p>
A professional code of ethics states the principles and core values that are essential to the work of a particular occupational group. Practitioners in many professions subscribe to a code of ethics that governs their behavior.
</p>

<p>
There are 4 fundamental principles of professional code of ethics. They are:
</p>
<ol class="org-ol">
<li>Ethical decision making</li>
<li>High standard of practice and ethical behavior</li>
<li>Trust and respect from the general public</li>
<li>Evaluation Benchmark</li>
</ol>
</div>
</div>
<div id="outline-container-org8c1f52b" class="outline-3">
<h3 id="org8c1f52b"><span class="section-number-3">4.13.</span> What are IT Professional Organizations? List some of the organizations and their roles.</h3>
<div class="outline-text-3" id="text-4-13">
<p>
These organizations disseminate information through email, periodicals, Web sites, meetings, and conferences. Furthermore, in recognition of the need for professional standards of competence and conduct, many of these organizations have developed codes of ethics.
</p>
</div>

<div id="outline-container-org5c8a12d" class="outline-4">
<h4 id="org5c8a12d"><span class="section-number-4">4.13.1.</span> Association for Computing Machinery (ACM):</h4>
<div class="outline-text-4" id="text-4-13-1">
<ul class="org-ul">
<li>publishes over 50 journals and magazines and 30 newsletters</li>
<li>offers a substantial digital library of bibliographic information, citations, articles, and journals</li>
<li>37 special-interest groups (SIGs) representing major areas of computing</li>
</ul>
</div>
</div>
<div id="outline-container-org39b7614" class="outline-4">
<h4 id="org39b7614"><span class="section-number-4">4.13.2.</span> Institute of Electrical and Electronics Engineers Computer Society (IEEE-CS):</h4>
<div class="outline-text-4" id="text-4-13-2">
<ul class="org-ul">
<li>covers the broad fields of electrical, electronic, and information technologies and science.</li>
<li>helps meet the information and career development needs of computing researchers and practitioners with technical journals, magazines, books, conferences, conference publications, and online courses.</li>
<li>offers a Certified Software Development Professional (CSDP) program for experienced professionals and a Certified Software Development Associate(CSDA) credential for recent college graduates</li>
<li>Sponsors conferences</li>
</ul>
</div>
</div>
<div id="outline-container-org55a01ae" class="outline-4">
<h4 id="org55a01ae"><span class="section-number-4">4.13.3.</span> Association of Information Technology Professionals (AITP):</h4>
<div class="outline-text-4" id="text-4-13-3">
<ul class="org-ul">
<li>provides IT-related seminars and conferences, information on IT issues, and forums for networking with other IT workers.</li>
<li>mission is to provide superior leadership and education in information technology</li>
</ul>
<p>
help members make themselves more marketable within their industry
</p>
<ul class="org-ul">
<li>Has a code of ethics and standards of conducts</li>
</ul>
</div>
</div>
