5th-Semester/Business-Ethics/final.org
* Questions
1. What is outsourcing? What is offshore outsouring? What are strategies for successful offshore outsouring?
2. Definition of contingent worker, H1B worker.
3. What are the key ethical issues for organizations?
4. Code of conducts of IT industry
5. Definition of green computing, out sourcing and offshore outsourcing
6. Strategy for successful offshore outsourcing
7. Whistle blowing preparation steps.
8. Definition of intellectual property, copyright, copyright infringement, patent, patent infringement, cross licensing agreement,
9. Eligibility for copyright
10. What are the laws for the proctection of software copyright?
11. Talk about digitial millenium act
12. Describe trade secret.
13. Discuss KEY INTELLECTUAL PROPERTY ISSUES
14. What are the Key Ethical Issues for Organizations?
15. Professionalism, Are IT Workers Professional?
16. Professional Relationships that must be maintained
17. Relationship between IT Workers & Employer
18. Relationship between IT Workers & Clients
19. Business Software Alliance: Stop unauthorized trading & manufacturing of product
20. Professional Code of Conduct
21. IT Professional Organizations
22. Certification: Knowledge, Skill, Abilities
23. Licensing vs Certification

