5th-Semester/Business-Ethics/final.html

<div id="outline-container-org1254d3d" class="outline-2">
<h2 id="org1254d3d"><span class="section-number-2">6.</span> Questions</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>What is outsourcing? What is offshore outsouring? What are strategies for successful offshore outsouring?</li>
<li>Definition of contingent worker, H1B worker.</li>
<li>What are the key ethical issues for organizations?</li>
<li>Code of conducts of IT industry</li>
<li>Definition of green computing, out sourcing and offshore outsourcing</li>
<li>Strategy for successful offshore outsourcing</li>
<li>Whistle blowing preparation steps.</li>
<li>Definition of intellectual property, copyright, copyright infringement, patent, patent infringement, cross licensing agreement,</li>
<li>Eligibility for copyright</li>
<li>What are the laws for the proctection of software copyright?</li>
<li>Talk about digitial millenium act</li>
<li>Describe trade secret.</li>
<li>Discuss KEY INTELLECTUAL PROPERTY ISSUES</li>
<li>What are the Key Ethical Issues for Organizations?</li>
<li>Professionalism, Are IT Workers Professional?</li>
<li>Professional Relationships that must be maintained</li>
<li>Relationship between IT Workers &amp; Employer</li>
<li>Relationship between IT Workers &amp; Clients</li>
<li>Business Software Alliance: Stop unauthorized trading &amp; manufacturing of product</li>
<li>Professional Code of Conduct</li>
<li>IT Professional Organizations</li>
<li>Certification: Knowledge, Skill, Abilities</li>
<li>Licensing vs Certification</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhijit Paul</p>
<p class="date">Created: 2023-05-16 মঙ্গল 01:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
