5th-Semester/Business-Ethics/final.tex

\section{Questions}
\label{sec:org3832d74}
\begin{enumerate}
\item What is outsourcing? What is offshore outsouring? What are strategies for successful offshore outsouring?
\item Definition of contingent worker, H1B worker.
\item What are the key ethical issues for organizations?
\item Code of conducts of IT industry
\item Definition of green computing, out sourcing and offshore outsourcing
\item Strategy for successful offshore outsourcing
\item Whistle blowing preparation steps.
\item Definition of intellectual property, copyright, copyright infringement, patent, patent infringement, cross licensing agreement,
\item Eligibility for copyright
\item What are the laws for the proctection of software copyright?
\item Talk about digitial millenium act
\item Describe trade secret.
\item Discuss KEY INTELLECTUAL PROPERTY ISSUES
\item What are the Key Ethical Issues for Organizations?
\item Professionalism, Are IT Workers Professional?
\item Professional Relationships that must be maintained
\item Relationship between IT Workers \& Employer
\item Relationship between IT Workers \& Clients
\item Business Software Alliance: Stop unauthorized trading \& manufacturing of product
\item Professional Code of Conduct
\item IT Professional Organizations
\item Certification: Knowledge, Skill, Abilities
\item Licensing vs Certification
\end{enumerate}
\end{document}